Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
extern volatile __IFS2bits_t IFS2bits __asm__ ("IFS2") __attribute__((section("sfrs"), address(0xBF810060)));
extern volatile uint32_t        IFS2CLR __attribute__((section("sfrs"),address(0xBF810064)));
extern volatile uint32_t        IFS2SET __attribute__((section("sfrs"),address(0xBF810068)));
extern volatile uint32_t        IFS2INV __attribute__((section("sfrs"),address(0xBF81006C)));
#define IFS3 IFS3
extern volatile uint32_t   IFS3 __attribute__((section("sfrs"), address(0xBF810070)));
typedef union {
  struct {
    uint32_t AD1DF1IF:1;
    uint32_t AD1DF2IF:1;
    uint32_t AD1DF3IF:1;
    uint32_t AD1DF4IF:1;
    uint32_t AD1FIIF:1;
    uint32_t AD1EOSIF:1;
    uint32_t AD1ARIF:1;
    uint32_t AD1RSIF:1;
    uint32_t AD1FCBTIF:1;
    uint32_t AD1GIF:1;
    uint32_t AD1D0IF:1;
    uint32_t AD1D1IF:1;
    uint32_t AD1D2IF:1;
    uint32_t AD1D3IF:1;
    uint32_t AD1D4IF:1;
    uint32_t AD1D5IF:1;
    uint32_t AD1D6IF:1;
    uint32_t AD1D7IF:1;
    uint32_t AD1D8IF:1;
    uint32_t AD1D9IF:1;
    uint32_t AD1D10IF:1;
    uint32_t AD1D11IF:1;
    uint32_t AD1D12IF:1;
    uint32_t AD1D13IF:1;
    uint32_t AD1D14IF:1;
    uint32_t AD1D15IF:1;
    uint32_t AD1D16IF:1;
    uint32_t AD1D17IF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS3bits_t;
extern volatile __IFS3bits_t IFS3bits __asm__ ("IFS3") __attribute__((section("sfrs"), address(0xBF810070)));
extern volatile uint32_t        IFS3CLR __attribute__((section("sfrs"),address(0xBF810074)));
extern volatile uint32_t        IFS3SET __attribute__((section("sfrs"),address(0xBF810078)));
extern volatile uint32_t        IFS3INV __attribute__((section("sfrs"),address(0xBF81007C)));
#define IFS4 IFS4
extern volatile uint32_t   IFS4 __attribute__((section("sfrs"), address(0xBF810080)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t AD1D50IF:1;
    uint32_t :2;
    uint32_t AD1D53IF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS4bits_t;
extern volatile __IFS4bits_t IFS4bits __asm__ ("IFS4") __attribute__((section("sfrs"), address(0xBF810080)));
extern volatile uint32_t        IFS4CLR __attribute__((section("sfrs"),address(0xBF810084)));
extern volatile uint32_t        IFS4SET __attribute__((section("sfrs"),address(0xBF810088)));
extern volatile uint32_t        IFS4INV __attribute__((section("sfrs"),address(0xBF81008C)));
#define IFS5 IFS5
extern volatile uint32_t   IFS5 __attribute__((section("sfrs"), address(0xBF810090)));
typedef union {
  struct {
    uint32_t CMP3IF:1;
    uint32_t :8;
    uint32_t QEI1IF:1;
    uint32_t QEI2IF:1;
    uint32_t PWMPEVTIF:1;
    uint32_t PWMSEVTIF:1;
    uint32_t PWM1IF:1;
    uint32_t PWM2IF:1;
    uint32_t PWM3IF:1;
    uint32_t PWM4IF:1;
    uint32_t :5;
    uint32_t DMA4IF:1;
    uint32_t DMA5IF:1;
    uint32_t DMA6IF:1;
    uint32_t DMA7IF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS5bits_t;
extern volatile __IFS5bits_t IFS5bits __asm__ ("IFS5") __attribute__((section("sfrs"), address(0xBF810090)));
extern volatile uint32_t        IFS5CLR __attribute__((section("sfrs"),address(0xBF810094)));
extern volatile uint32_t        IFS5SET __attribute__((section("sfrs"),address(0xBF810098)));
extern volatile uint32_t        IFS5INV __attribute__((section("sfrs"),address(0xBF81009C)));
#define IFS7 IFS7
extern volatile uint32_t   IFS7 __attribute__((section("sfrs"), address(0xBF8100B0)));
typedef union {
  struct {
    uint32_t :6;
    uint32_t SBIF:1;
    uint32_t :16;
    uint32_t PCACHEIF:1;
    uint32_t :1;
    uint32_t CLC1IF:1;
    uint32_t :4;
    uint32_t CPCIF:1;
    uint32_t CPDIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS7bits_t;
extern volatile __IFS7bits_t IFS7bits __asm__ ("IFS7") __attribute__((section("sfrs"), address(0xBF8100B0)));
extern volatile uint32_t        IFS7CLR __attribute__((section("sfrs"),address(0xBF8100B4)));
extern volatile uint32_t        IFS7SET __attribute__((section("sfrs"),address(0xBF8100B8)));
extern volatile uint32_t        IFS7INV __attribute__((section("sfrs"),address(0xBF8100BC)));
#define IEC0 IEC0
extern volatile uint32_t   IEC0 __attribute__((section("sfrs"), address(0xBF8100C0)));
typedef union {
  struct {
    uint32_t CTIE:1;
    uint32_t CS0IE:1;
    uint32_t CS1IE:1;
    uint32_t INT0IE:1;
    uint32_t T1IE:1;
    uint32_t IC1EIE:1;
    uint32_t IC1IE:1;
    uint32_t OC1IE:1;
    uint32_t INT1IE:1;
    uint32_t T2IE:1;
    uint32_t IC2EIE:1;
    uint32_t IC2IE:1;
    uint32_t OC2IE:1;
    uint32_t INT2IE:1;
    uint32_t T3IE:1;
    uint32_t IC3EIE:1;
    uint32_t IC3IE:1;
    uint32_t OC3IE:1;
    uint32_t INT3IE:1;
    uint32_t T4IE:1;
    uint32_t IC4EIE:1;
    uint32_t IC4IE:1;
    uint32_t OC4IE:1;
    uint32_t INT4IE:1;
    uint32_t T5IE:1;
    uint32_t :5;
    uint32_t RTCCIE:1;
    uint32_t FCEIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC0bits_t;
extern volatile __IEC0bits_t IEC0bits __asm__ ("IEC0") __attribute__((section("sfrs"), address(0xBF8100C0)));
extern volatile uint32_t        IEC0CLR __attribute__((section("sfrs"),address(0xBF8100C4)));
extern volatile uint32_t        IEC0SET __attribute__((section("sfrs"),address(0xBF8100C8)));
extern volatile uint32_t        IEC0INV __attribute__((section("sfrs"),address(0xBF8100CC)));
#define IEC1 IEC1
extern volatile uint32_t   IEC1 __attribute__((section("sfrs"), address(0xBF8100D0)));
typedef union {
  struct {
    uint32_t CMP1IE:1;
    uint32_t CMP2IE:1;
    uint32_t :1;
    uint32_t SPI1EIE:1;
    uint32_t SPI1RXIE:1;
    uint32_t SPI1TXIE:1;
    uint32_t U1EIE:1;
    uint32_t U1RXIE:1;
    uint32_t U1TXIE:1;
    uint32_t I2C1BIE:1;
    uint32_t I2C1SIE:1;
    uint32_t I2C1MIE:1;
    uint32_t CNAIE:1;
    uint32_t CNBIE:1;
    uint32_t CNCIE:1;
    uint32_t CNDIE:1;
    uint32_t :5;
    uint32_t SPI2EIE:1;
    uint32_t SPI2RXIE:1;
    uint32_t SPI2TXIE:1;
    uint32_t U2EIE:1;
    uint32_t U2RXIE:1;
    uint32_t U2TXIE:1;
    uint32_t I2C2BIE:1;
    uint32_t I2C2SIE:1;
    uint32_t I2C2MIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC1bits_t;
extern volatile __IEC1bits_t IEC1bits __asm__ ("IEC1") __attribute__((section("sfrs"), address(0xBF8100D0)));
extern volatile uint32_t        IEC1CLR __attribute__((section("sfrs"),address(0xBF8100D4)));
extern volatile uint32_t        IEC1SET __attribute__((section("sfrs"),address(0xBF8100D8)));
extern volatile uint32_t        IEC1INV __attribute__((section("sfrs"),address(0xBF8100DC)));
#define IEC2 IEC2
extern volatile uint32_t   IEC2 __attribute__((section("sfrs"), address(0xBF8100E0)));
typedef union {
  struct {
    uint32_t :7;
    uint32_t CTMUIE:1;
    uint32_t DMA0IE:1;
    uint32_t DMA1IE:1;
    uint32_t DMA2IE:1;
    uint32_t DMA3IE:1;
    uint32_t :16;
    uint32_t AD1IE:1;
    uint32_t :1;
    uint32_t AD1DC1IE:1;
    uint32_t AD1DC2IE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC2bits_t;
extern volatile __IEC2bits_t IEC2bits __asm__ ("IEC2") __attribute__((section("sfrs"), address(0xBF8100E0)));
extern volatile uint32_t        IEC2CLR __attribute__((section("sfrs"),address(0xBF8100E4)));
extern volatile uint32_t        IEC2SET __attribute__((section("sfrs"),address(0xBF8100E8)));
extern volatile uint32_t        IEC2INV __attribute__((section("sfrs"),address(0xBF8100EC)));
#define IEC3 IEC3
extern volatile uint32_t   IEC3 __attribute__((section("sfrs"), address(0xBF8100F0)));
typedef union {
  struct {
    uint32_t AD1DF1IE:1;
    uint32_t AD1DF2IE:1;
    uint32_t :2;
    uint32_t AD1FIIE:1;
    uint32_t AD1EOSIE:1;
    uint32_t AD1ARIE:1;
    uint32_t AD1RSIE:1;
    uint32_t AD1FCBTIE:1;
    uint32_t AD1GIE:1;
    uint32_t AD1D0IE:1;
    uint32_t AD1D1IE:1;
    uint32_t AD1D2IE:1;
    uint32_t AD1D3IE:1;
    uint32_t AD1D4IE:1;
    uint32_t AD1D5IE:1;
    uint32_t AD1D6IE:1;
    uint32_t AD1D7IE:1;
    uint32_t AD1D8IE:1;
    uint32_t AD1D9IE:1;
    uint32_t AD1D10IE:1;
    uint32_t AD1D11IE:1;
    uint32_t AD1D12IE:1;
    uint32_t AD1D13IE:1;
    uint32_t AD1D14IE:1;
    uint32_t AD1D15IE:1;
    uint32_t AD1D16IE:1;
    uint32_t AD1D17IE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC3bits_t;
extern volatile __IEC3bits_t IEC3bits __asm__ ("IEC3") __attribute__((section("sfrs"), address(0xBF8100F0)));
extern volatile uint32_t        IEC3CLR __attribute__((section("sfrs"),address(0xBF8100F4)));
extern volatile uint32_t        IEC3SET __attribute__((section("sfrs"),address(0xBF8100F8)));
extern volatile uint32_t        IEC3INV __attribute__((section("sfrs"),address(0xBF8100FC)));
#define IEC4 IEC4
extern volatile uint32_t   IEC4 __attribute__((section("sfrs"), address(0xBF810100)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t AD1D50IE:1;
    uint32_t :2;
    uint32_t AD1D53IE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC4bits_t;
