Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
extern volatile __OFF156bits_t OFF156bits __asm__ ("OFF156") __attribute__((section("sfrs"), address(0xBF8107B0)));
#define OFF159 OFF159
extern volatile uint32_t   OFF159 __attribute__((section("sfrs"), address(0xBF8107BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF159bits_t;
extern volatile __OFF159bits_t OFF159bits __asm__ ("OFF159") __attribute__((section("sfrs"), address(0xBF8107BC)));
#define OFF160 OFF160
extern volatile uint32_t   OFF160 __attribute__((section("sfrs"), address(0xBF8107C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF160bits_t;
extern volatile __OFF160bits_t OFF160bits __asm__ ("OFF160") __attribute__((section("sfrs"), address(0xBF8107C0)));
#define OFF169 OFF169
extern volatile uint32_t   OFF169 __attribute__((section("sfrs"), address(0xBF8107E4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF169bits_t;
extern volatile __OFF169bits_t OFF169bits __asm__ ("OFF169") __attribute__((section("sfrs"), address(0xBF8107E4)));
#define OFF170 OFF170
extern volatile uint32_t   OFF170 __attribute__((section("sfrs"), address(0xBF8107E8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF170bits_t;
extern volatile __OFF170bits_t OFF170bits __asm__ ("OFF170") __attribute__((section("sfrs"), address(0xBF8107E8)));
#define OFF171 OFF171
extern volatile uint32_t   OFF171 __attribute__((section("sfrs"), address(0xBF8107EC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF171bits_t;
extern volatile __OFF171bits_t OFF171bits __asm__ ("OFF171") __attribute__((section("sfrs"), address(0xBF8107EC)));
#define OFF172 OFF172
extern volatile uint32_t   OFF172 __attribute__((section("sfrs"), address(0xBF8107F0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF172bits_t;
extern volatile __OFF172bits_t OFF172bits __asm__ ("OFF172") __attribute__((section("sfrs"), address(0xBF8107F0)));
#define OFF173 OFF173
extern volatile uint32_t   OFF173 __attribute__((section("sfrs"), address(0xBF8107F4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF173bits_t;
extern volatile __OFF173bits_t OFF173bits __asm__ ("OFF173") __attribute__((section("sfrs"), address(0xBF8107F4)));
#define OFF174 OFF174
extern volatile uint32_t   OFF174 __attribute__((section("sfrs"), address(0xBF8107F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF174bits_t;
extern volatile __OFF174bits_t OFF174bits __asm__ ("OFF174") __attribute__((section("sfrs"), address(0xBF8107F8)));
#define OFF175 OFF175
extern volatile uint32_t   OFF175 __attribute__((section("sfrs"), address(0xBF8107FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF175bits_t;
extern volatile __OFF175bits_t OFF175bits __asm__ ("OFF175") __attribute__((section("sfrs"), address(0xBF8107FC)));
#define OFF176 OFF176
extern volatile uint32_t   OFF176 __attribute__((section("sfrs"), address(0xBF810800)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF176bits_t;
extern volatile __OFF176bits_t OFF176bits __asm__ ("OFF176") __attribute__((section("sfrs"), address(0xBF810800)));
#define OFF182 OFF182
extern volatile uint32_t   OFF182 __attribute__((section("sfrs"), address(0xBF810818)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF182bits_t;
extern volatile __OFF182bits_t OFF182bits __asm__ ("OFF182") __attribute__((section("sfrs"), address(0xBF810818)));
#define OFF183 OFF183
extern volatile uint32_t   OFF183 __attribute__((section("sfrs"), address(0xBF81081C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF183bits_t;
extern volatile __OFF183bits_t OFF183bits __asm__ ("OFF183") __attribute__((section("sfrs"), address(0xBF81081C)));
#define OFF184 OFF184
extern volatile uint32_t   OFF184 __attribute__((section("sfrs"), address(0xBF810820)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF184bits_t;
extern volatile __OFF184bits_t OFF184bits __asm__ ("OFF184") __attribute__((section("sfrs"), address(0xBF810820)));
#define OFF185 OFF185
extern volatile uint32_t   OFF185 __attribute__((section("sfrs"), address(0xBF810824)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF185bits_t;
extern volatile __OFF185bits_t OFF185bits __asm__ ("OFF185") __attribute__((section("sfrs"), address(0xBF810824)));
#define OFF230 OFF230
extern volatile uint32_t   OFF230 __attribute__((section("sfrs"), address(0xBF8108D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF230bits_t;
extern volatile __OFF230bits_t OFF230bits __asm__ ("OFF230") __attribute__((section("sfrs"), address(0xBF8108D8)));
#define OFF247 OFF247
extern volatile uint32_t   OFF247 __attribute__((section("sfrs"), address(0xBF81091C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF247bits_t;
extern volatile __OFF247bits_t OFF247bits __asm__ ("OFF247") __attribute__((section("sfrs"), address(0xBF81091C)));
#define OFF249 OFF249
extern volatile uint32_t   OFF249 __attribute__((section("sfrs"), address(0xBF810924)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF249bits_t;
extern volatile __OFF249bits_t OFF249bits __asm__ ("OFF249") __attribute__((section("sfrs"), address(0xBF810924)));
#define OFF254 OFF254
extern volatile uint32_t   OFF254 __attribute__((section("sfrs"), address(0xBF810938)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF254bits_t;
extern volatile __OFF254bits_t OFF254bits __asm__ ("OFF254") __attribute__((section("sfrs"), address(0xBF810938)));
#define OFF255 OFF255
extern volatile uint32_t   OFF255 __attribute__((section("sfrs"), address(0xBF81093C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF255bits_t;
extern volatile __OFF255bits_t OFF255bits __asm__ ("OFF255") __attribute__((section("sfrs"), address(0xBF81093C)));
#define DMACON DMACON
extern volatile uint32_t   DMACON __attribute__((section("sfrs"), address(0xBF811000)));
typedef struct {
  uint32_t :11;
  uint32_t DMABUSY:1;
  uint32_t SUSPEND:1;
  uint32_t :2;
  uint32_t ON:1;
} __DMACONbits_t;
extern volatile __DMACONbits_t DMACONbits __asm__ ("DMACON") __attribute__((section("sfrs"), address(0xBF811000)));
extern volatile uint32_t        DMACONCLR __attribute__((section("sfrs"),address(0xBF811004)));
extern volatile uint32_t        DMACONSET __attribute__((section("sfrs"),address(0xBF811008)));
extern volatile uint32_t        DMACONINV __attribute__((section("sfrs"),address(0xBF81100C)));
#define DMASTAT DMASTAT
extern volatile uint32_t   DMASTAT __attribute__((section("sfrs"), address(0xBF811010)));
typedef struct {
  uint32_t DMACH:3;
  uint32_t :28;
  uint32_t RDWR:1;
} __DMASTATbits_t;
