Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
extern volatile __T4CONbits_t T4CONbits __asm__ ("T4CON") __attribute__((section("sfrs"), address(0xBF820600)));
extern volatile uint32_t        T4CONCLR __attribute__((section("sfrs"),address(0xBF820604)));
extern volatile uint32_t        T4CONSET __attribute__((section("sfrs"),address(0xBF820608)));
extern volatile uint32_t        T4CONINV __attribute__((section("sfrs"),address(0xBF82060C)));
#define TMR4 TMR4
extern volatile uint32_t   TMR4 __attribute__((section("sfrs"), address(0xBF820610)));
extern volatile uint32_t        TMR4CLR __attribute__((section("sfrs"),address(0xBF820614)));
extern volatile uint32_t        TMR4SET __attribute__((section("sfrs"),address(0xBF820618)));
extern volatile uint32_t        TMR4INV __attribute__((section("sfrs"),address(0xBF82061C)));
#define PR4 PR4
extern volatile uint32_t   PR4 __attribute__((section("sfrs"), address(0xBF820620)));
extern volatile uint32_t        PR4CLR __attribute__((section("sfrs"),address(0xBF820624)));
extern volatile uint32_t        PR4SET __attribute__((section("sfrs"),address(0xBF820628)));
extern volatile uint32_t        PR4INV __attribute__((section("sfrs"),address(0xBF82062C)));
#define T5CON T5CON
extern volatile uint32_t   T5CON __attribute__((section("sfrs"), address(0xBF820800)));
typedef struct {
  uint32_t :1;
  uint32_t TCS:1;
  uint32_t :1;
  uint32_t T32:1;
  uint32_t TCKPS:3;
  uint32_t TGATE:1;
  uint32_t SYNC:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __T5CONbits_t;
extern volatile __T5CONbits_t T5CONbits __asm__ ("T5CON") __attribute__((section("sfrs"), address(0xBF820800)));
extern volatile uint32_t        T5CONCLR __attribute__((section("sfrs"),address(0xBF820804)));
extern volatile uint32_t        T5CONSET __attribute__((section("sfrs"),address(0xBF820808)));
extern volatile uint32_t        T5CONINV __attribute__((section("sfrs"),address(0xBF82080C)));
#define TMR5 TMR5
extern volatile uint32_t   TMR5 __attribute__((section("sfrs"), address(0xBF820810)));
extern volatile uint32_t        TMR5CLR __attribute__((section("sfrs"),address(0xBF820814)));
extern volatile uint32_t        TMR5SET __attribute__((section("sfrs"),address(0xBF820818)));
extern volatile uint32_t        TMR5INV __attribute__((section("sfrs"),address(0xBF82081C)));
#define PR5 PR5
extern volatile uint32_t   PR5 __attribute__((section("sfrs"), address(0xBF820820)));
extern volatile uint32_t        PR5CLR __attribute__((section("sfrs"),address(0xBF820824)));
extern volatile uint32_t        PR5SET __attribute__((section("sfrs"),address(0xBF820828)));
extern volatile uint32_t        PR5INV __attribute__((section("sfrs"),address(0xBF82082C)));
#define IC1CON IC1CON
extern volatile uint32_t   IC1CON __attribute__((section("sfrs"), address(0xBF822000)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC1CONbits_t;
extern volatile __IC1CONbits_t IC1CONbits __asm__ ("IC1CON") __attribute__((section("sfrs"), address(0xBF822000)));
extern volatile uint32_t        IC1CONCLR __attribute__((section("sfrs"),address(0xBF822004)));
extern volatile uint32_t        IC1CONSET __attribute__((section("sfrs"),address(0xBF822008)));
extern volatile uint32_t        IC1CONINV __attribute__((section("sfrs"),address(0xBF82200C)));
#define IC1BUF IC1BUF
extern volatile uint32_t   IC1BUF __attribute__((section("sfrs"), address(0xBF822010)));
#define IC2CON IC2CON
extern volatile uint32_t   IC2CON __attribute__((section("sfrs"), address(0xBF822200)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC2CONbits_t;
extern volatile __IC2CONbits_t IC2CONbits __asm__ ("IC2CON") __attribute__((section("sfrs"), address(0xBF822200)));
extern volatile uint32_t        IC2CONCLR __attribute__((section("sfrs"),address(0xBF822204)));
extern volatile uint32_t        IC2CONSET __attribute__((section("sfrs"),address(0xBF822208)));
extern volatile uint32_t        IC2CONINV __attribute__((section("sfrs"),address(0xBF82220C)));
#define IC2BUF IC2BUF
extern volatile uint32_t   IC2BUF __attribute__((section("sfrs"), address(0xBF822210)));
#define IC3CON IC3CON
extern volatile uint32_t   IC3CON __attribute__((section("sfrs"), address(0xBF822400)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC3CONbits_t;
extern volatile __IC3CONbits_t IC3CONbits __asm__ ("IC3CON") __attribute__((section("sfrs"), address(0xBF822400)));
extern volatile uint32_t        IC3CONCLR __attribute__((section("sfrs"),address(0xBF822404)));
extern volatile uint32_t        IC3CONSET __attribute__((section("sfrs"),address(0xBF822408)));
extern volatile uint32_t        IC3CONINV __attribute__((section("sfrs"),address(0xBF82240C)));
#define IC3BUF IC3BUF
extern volatile uint32_t   IC3BUF __attribute__((section("sfrs"), address(0xBF822410)));
#define IC4CON IC4CON
extern volatile uint32_t   IC4CON __attribute__((section("sfrs"), address(0xBF822600)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC4CONbits_t;
