Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
extern volatile __PWMCON4bits_t PWMCON4bits __asm__ ("PWMCON4") __attribute__((section("sfrs"), address(0xBF82A3C0)));
extern volatile uint32_t        PWMCON4CLR __attribute__((section("sfrs"),address(0xBF82A3C4)));
extern volatile uint32_t        PWMCON4SET __attribute__((section("sfrs"),address(0xBF82A3C8)));
extern volatile uint32_t        PWMCON4INV __attribute__((section("sfrs"),address(0xBF82A3CC)));
#define IOCON4 IOCON4
extern volatile uint32_t   IOCON4 __attribute__((section("sfrs"), address(0xBF82A3D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON4bits_t;
extern volatile __IOCON4bits_t IOCON4bits __asm__ ("IOCON4") __attribute__((section("sfrs"), address(0xBF82A3D0)));
extern volatile uint32_t        IOCON4CLR __attribute__((section("sfrs"),address(0xBF82A3D4)));
extern volatile uint32_t        IOCON4SET __attribute__((section("sfrs"),address(0xBF82A3D8)));
extern volatile uint32_t        IOCON4INV __attribute__((section("sfrs"),address(0xBF82A3DC)));
#define PDC4 PDC4
extern volatile uint32_t   PDC4 __attribute__((section("sfrs"), address(0xBF82A3E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC4bits_t;
extern volatile __PDC4bits_t PDC4bits __asm__ ("PDC4") __attribute__((section("sfrs"), address(0xBF82A3E0)));
extern volatile uint32_t        PDC4CLR __attribute__((section("sfrs"),address(0xBF82A3E4)));
extern volatile uint32_t        PDC4SET __attribute__((section("sfrs"),address(0xBF82A3E8)));
extern volatile uint32_t        PDC4INV __attribute__((section("sfrs"),address(0xBF82A3EC)));
#define SDC4 SDC4
extern volatile uint32_t   SDC4 __attribute__((section("sfrs"), address(0xBF82A3F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC4bits_t;
extern volatile __SDC4bits_t SDC4bits __asm__ ("SDC4") __attribute__((section("sfrs"), address(0xBF82A3F0)));
extern volatile uint32_t        SDC4CLR __attribute__((section("sfrs"),address(0xBF82A3F4)));
extern volatile uint32_t        SDC4SET __attribute__((section("sfrs"),address(0xBF82A3F8)));
extern volatile uint32_t        SDC4INV __attribute__((section("sfrs"),address(0xBF82A3FC)));
#define PHASE4 PHASE4
extern volatile uint32_t   PHASE4 __attribute__((section("sfrs"), address(0xBF82A400)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE4bits_t;
extern volatile __PHASE4bits_t PHASE4bits __asm__ ("PHASE4") __attribute__((section("sfrs"), address(0xBF82A400)));
extern volatile uint32_t        PHASE4CLR __attribute__((section("sfrs"),address(0xBF82A404)));
extern volatile uint32_t        PHASE4SET __attribute__((section("sfrs"),address(0xBF82A408)));
extern volatile uint32_t        PHASE4INV __attribute__((section("sfrs"),address(0xBF82A40C)));
#define DTR4 DTR4
extern volatile uint32_t   DTR4 __attribute__((section("sfrs"), address(0xBF82A410)));
typedef struct {
  uint32_t DTR:16;
} __DTR4bits_t;
extern volatile __DTR4bits_t DTR4bits __asm__ ("DTR4") __attribute__((section("sfrs"), address(0xBF82A410)));
extern volatile uint32_t        DTR4CLR __attribute__((section("sfrs"),address(0xBF82A414)));
extern volatile uint32_t        DTR4SET __attribute__((section("sfrs"),address(0xBF82A418)));
extern volatile uint32_t        DTR4INV __attribute__((section("sfrs"),address(0xBF82A41C)));
#define ALTDTR4 ALTDTR4
extern volatile uint32_t   ALTDTR4 __attribute__((section("sfrs"), address(0xBF82A420)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR4bits_t;
extern volatile __ALTDTR4bits_t ALTDTR4bits __asm__ ("ALTDTR4") __attribute__((section("sfrs"), address(0xBF82A420)));
extern volatile uint32_t        ALTDTR4CLR __attribute__((section("sfrs"),address(0xBF82A424)));
extern volatile uint32_t        ALTDTR4SET __attribute__((section("sfrs"),address(0xBF82A428)));
extern volatile uint32_t        ALTDTR4INV __attribute__((section("sfrs"),address(0xBF82A42C)));
#define DTCOMP4 DTCOMP4
extern volatile uint32_t   DTCOMP4 __attribute__((section("sfrs"), address(0xBF82A430)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP4bits_t;
extern volatile __DTCOMP4bits_t DTCOMP4bits __asm__ ("DTCOMP4") __attribute__((section("sfrs"), address(0xBF82A430)));
extern volatile uint32_t        DTCOMP4CLR __attribute__((section("sfrs"),address(0xBF82A434)));
extern volatile uint32_t        DTCOMP4SET __attribute__((section("sfrs"),address(0xBF82A438)));
extern volatile uint32_t        DTCOMP4INV __attribute__((section("sfrs"),address(0xBF82A43C)));
#define TRIG4 TRIG4
extern volatile uint32_t   TRIG4 __attribute__((section("sfrs"), address(0xBF82A440)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG4bits_t;
extern volatile __TRIG4bits_t TRIG4bits __asm__ ("TRIG4") __attribute__((section("sfrs"), address(0xBF82A440)));
extern volatile uint32_t        TRIG4CLR __attribute__((section("sfrs"),address(0xBF82A444)));
extern volatile uint32_t        TRIG4SET __attribute__((section("sfrs"),address(0xBF82A448)));
extern volatile uint32_t        TRIG4INV __attribute__((section("sfrs"),address(0xBF82A44C)));
#define TRGCON4 TRGCON4
extern volatile uint32_t   TRGCON4 __attribute__((section("sfrs"), address(0xBF82A450)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON4bits_t;
extern volatile __TRGCON4bits_t TRGCON4bits __asm__ ("TRGCON4") __attribute__((section("sfrs"), address(0xBF82A450)));
extern volatile uint32_t        TRGCON4CLR __attribute__((section("sfrs"),address(0xBF82A454)));
extern volatile uint32_t        TRGCON4SET __attribute__((section("sfrs"),address(0xBF82A458)));
extern volatile uint32_t        TRGCON4INV __attribute__((section("sfrs"),address(0xBF82A45C)));
#define STRIG4 STRIG4
extern volatile uint32_t   STRIG4 __attribute__((section("sfrs"), address(0xBF82A460)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG4bits_t;
