Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
  .extern T2CONSET         /* 0xBF820208 */
  .extern T2CONINV         /* 0xBF82020C */
  .extern TMR2             /* 0xBF820210 */
  .extern TMR2CLR          /* 0xBF820214 */
  .extern TMR2SET          /* 0xBF820218 */
  .extern TMR2INV          /* 0xBF82021C */
  .extern PR2              /* 0xBF820220 */
  .extern PR2CLR           /* 0xBF820224 */
  .extern PR2SET           /* 0xBF820228 */
  .extern PR2INV           /* 0xBF82022C */
  .extern T3CON            /* 0xBF820400 */
  .extern T3CONCLR         /* 0xBF820404 */
  .extern T3CONSET         /* 0xBF820408 */
  .extern T3CONINV         /* 0xBF82040C */
  .extern TMR3             /* 0xBF820410 */
  .extern TMR3CLR          /* 0xBF820414 */
  .extern TMR3SET          /* 0xBF820418 */
  .extern TMR3INV          /* 0xBF82041C */
  .extern PR3              /* 0xBF820420 */
  .extern PR3CLR           /* 0xBF820424 */
  .extern PR3SET           /* 0xBF820428 */
  .extern PR3INV           /* 0xBF82042C */
  .extern T4CON            /* 0xBF820600 */
  .extern T4CONCLR         /* 0xBF820604 */
  .extern T4CONSET         /* 0xBF820608 */
  .extern T4CONINV         /* 0xBF82060C */
  .extern TMR4             /* 0xBF820610 */
  .extern TMR4CLR          /* 0xBF820614 */
  .extern TMR4SET          /* 0xBF820618 */
  .extern TMR4INV          /* 0xBF82061C */
  .extern PR4              /* 0xBF820620 */
  .extern PR4CLR           /* 0xBF820624 */
  .extern PR4SET           /* 0xBF820628 */
  .extern PR4INV           /* 0xBF82062C */
  .extern T5CON            /* 0xBF820800 */
  .extern T5CONCLR         /* 0xBF820804 */
  .extern T5CONSET         /* 0xBF820808 */
  .extern T5CONINV         /* 0xBF82080C */
  .extern TMR5             /* 0xBF820810 */
  .extern TMR5CLR          /* 0xBF820814 */
  .extern TMR5SET          /* 0xBF820818 */
  .extern TMR5INV          /* 0xBF82081C */
  .extern PR5              /* 0xBF820820 */
  .extern PR5CLR           /* 0xBF820824 */
  .extern PR5SET           /* 0xBF820828 */
  .extern PR5INV           /* 0xBF82082C */
  .extern IC1CON           /* 0xBF822000 */
  .extern IC1CONCLR        /* 0xBF822004 */
  .extern IC1CONSET        /* 0xBF822008 */
  .extern IC1CONINV        /* 0xBF82200C */
  .extern IC1BUF           /* 0xBF822010 */
  .extern IC2CON           /* 0xBF822200 */
  .extern IC2CONCLR        /* 0xBF822204 */
  .extern IC2CONSET        /* 0xBF822208 */
  .extern IC2CONINV        /* 0xBF82220C */
  .extern IC2BUF           /* 0xBF822210 */
  .extern IC3CON           /* 0xBF822400 */
  .extern IC3CONCLR        /* 0xBF822404 */
  .extern IC3CONSET        /* 0xBF822408 */
  .extern IC3CONINV        /* 0xBF82240C */
  .extern IC3BUF           /* 0xBF822410 */
  .extern IC4CON           /* 0xBF822600 */
  .extern IC4CONCLR        /* 0xBF822604 */
  .extern IC4CONSET        /* 0xBF822608 */
  .extern IC4CONINV        /* 0xBF82260C */
  .extern IC4BUF           /* 0xBF822610 */
  .extern OC1CON           /* 0xBF824000 */
  .extern OC1CONCLR        /* 0xBF824004 */
  .extern OC1CONSET        /* 0xBF824008 */
  .extern OC1CONINV        /* 0xBF82400C */
  .extern OC1R             /* 0xBF824010 */
  .extern OC1RCLR          /* 0xBF824014 */
  .extern OC1RSET          /* 0xBF824018 */
  .extern OC1RINV          /* 0xBF82401C */
  .extern OC1RS            /* 0xBF824020 */
  .extern OC1RSCLR         /* 0xBF824024 */
  .extern OC1RSSET         /* 0xBF824028 */
  .extern OC1RSINV         /* 0xBF82402C */
  .extern OC2CON           /* 0xBF824200 */
  .extern OC2CONCLR        /* 0xBF824204 */
  .extern OC2CONSET        /* 0xBF824208 */
  .extern OC2CONINV        /* 0xBF82420C */
  .extern OC2R             /* 0xBF824210 */
  .extern OC2RCLR          /* 0xBF824214 */
  .extern OC2RSET          /* 0xBF824218 */
  .extern OC2RINV          /* 0xBF82421C */
  .extern OC2RS            /* 0xBF824220 */
  .extern OC2RSCLR         /* 0xBF824224 */
  .extern OC2RSSET         /* 0xBF824228 */
  .extern OC2RSINV         /* 0xBF82422C */
  .extern OC3CON           /* 0xBF824400 */
  .extern OC3CONCLR        /* 0xBF824404 */
  .extern OC3CONSET        /* 0xBF824408 */
  .extern OC3CONINV        /* 0xBF82440C */
  .extern OC3R             /* 0xBF824410 */
  .extern OC3RCLR          /* 0xBF824414 */
  .extern OC3RSET          /* 0xBF824418 */
  .extern OC3RINV          /* 0xBF82441C */
  .extern OC3RS            /* 0xBF824420 */
  .extern OC3RSCLR         /* 0xBF824424 */
  .extern OC3RSSET         /* 0xBF824428 */
  .extern OC3RSINV         /* 0xBF82442C */
  .extern OC4CON           /* 0xBF824600 */
  .extern OC4CONCLR        /* 0xBF824604 */
  .extern OC4CONSET        /* 0xBF824608 */
  .extern OC4CONINV        /* 0xBF82460C */
  .extern OC4R             /* 0xBF824610 */
  .extern OC4RCLR          /* 0xBF824614 */
  .extern OC4RSET          /* 0xBF824618 */
  .extern OC4RINV          /* 0xBF82461C */
  .extern OC4RS            /* 0xBF824620 */
  .extern OC4RSCLR         /* 0xBF824624 */
  .extern OC4RSSET         /* 0xBF824628 */
  .extern OC4RSINV         /* 0xBF82462C */
  .extern I2C1CON          /* 0xBF826000 */
  .extern I2C1CONCLR       /* 0xBF826004 */
  .extern I2C1CONSET       /* 0xBF826008 */
  .extern I2C1CONINV       /* 0xBF82600C */
  .extern I2C1STAT         /* 0xBF826010 */
  .extern I2C1STATCLR      /* 0xBF826014 */
  .extern I2C1STATSET      /* 0xBF826018 */
  .extern I2C1STATINV      /* 0xBF82601C */
  .extern I2C1ADD          /* 0xBF826020 */
  .extern I2C1ADDCLR       /* 0xBF826024 */
  .extern I2C1ADDSET       /* 0xBF826028 */
  .extern I2C1ADDINV       /* 0xBF82602C */
  .extern I2C1MSK          /* 0xBF826030 */
  .extern I2C1MSKCLR       /* 0xBF826034 */
  .extern I2C1MSKSET       /* 0xBF826038 */
  .extern I2C1MSKINV       /* 0xBF82603C */
  .extern I2C1BRG          /* 0xBF826040 */
  .extern I2C1BRGCLR       /* 0xBF826044 */
  .extern I2C1BRGSET       /* 0xBF826048 */
  .extern I2C1BRGINV       /* 0xBF82604C */
  .extern I2C1TRN          /* 0xBF826050 */
  .extern I2C1TRNCLR       /* 0xBF826054 */
  .extern I2C1TRNSET       /* 0xBF826058 */
  .extern I2C1TRNINV       /* 0xBF82605C */
  .extern I2C1RCV          /* 0xBF826060 */
  .extern I2C1RCVCLR       /* 0xBF826064 */
  .extern I2C1RCVSET       /* 0xBF826068 */
  .extern I2C1RCVINV       /* 0xBF82606C */
  .extern I2C2CON          /* 0xBF826200 */
  .extern I2C2CONCLR       /* 0xBF826204 */
  .extern I2C2CONSET       /* 0xBF826208 */
  .extern I2C2CONINV       /* 0xBF82620C */
  .extern I2C2STAT         /* 0xBF826210 */
  .extern I2C2STATCLR      /* 0xBF826214 */
  .extern I2C2STATSET      /* 0xBF826218 */
  .extern I2C2STATINV      /* 0xBF82621C */
  .extern I2C2ADD          /* 0xBF826220 */
  .extern I2C2ADDCLR       /* 0xBF826224 */
  .extern I2C2ADDSET       /* 0xBF826228 */
  .extern I2C2ADDINV       /* 0xBF82622C */
  .extern I2C2MSK          /* 0xBF826230 */
  .extern I2C2MSKCLR       /* 0xBF826234 */
  .extern I2C2MSKSET       /* 0xBF826238 */
  .extern I2C2MSKINV       /* 0xBF82623C */
  .extern I2C2BRG          /* 0xBF826240 */
  .extern I2C2BRGCLR       /* 0xBF826244 */
  .extern I2C2BRGSET       /* 0xBF826248 */
  .extern I2C2BRGINV       /* 0xBF82624C */
  .extern I2C2TRN          /* 0xBF826250 */
  .extern I2C2TRNCLR       /* 0xBF826254 */
  .extern I2C2TRNSET       /* 0xBF826258 */
  .extern I2C2TRNINV       /* 0xBF82625C */
  .extern I2C2RCV          /* 0xBF826260 */
  .extern I2C2RCVCLR       /* 0xBF826264 */
  .extern I2C2RCVSET       /* 0xBF826268 */
  .extern I2C2RCVINV       /* 0xBF82626C */
  .extern SPI1CON          /* 0xBF827000 */
  .extern SPI1CONCLR       /* 0xBF827004 */
  .extern SPI1CONSET       /* 0xBF827008 */
  .extern SPI1CONINV       /* 0xBF82700C */
  .extern SPI1STAT         /* 0xBF827010 */
  .extern SPI1STATCLR      /* 0xBF827014 */
  .extern SPI1STATSET      /* 0xBF827018 */
  .extern SPI1STATINV      /* 0xBF82701C */
  .extern SPI1BUF          /* 0xBF827020 */
  .extern SPI1BRG          /* 0xBF827030 */
  .extern SPI1BRGCLR       /* 0xBF827034 */
  .extern SPI1BRGSET       /* 0xBF827038 */
  .extern SPI1BRGINV       /* 0xBF82703C */
  .extern SPI1CON2         /* 0xBF827040 */
  .extern SPI1CON2CLR      /* 0xBF827044 */
  .extern SPI1CON2SET      /* 0xBF827048 */
  .extern SPI1CON2INV      /* 0xBF82704C */
  .extern SPI2CON          /* 0xBF827200 */
  .extern SPI2CONCLR       /* 0xBF827204 */
  .extern SPI2CONSET       /* 0xBF827208 */
  .extern SPI2CONINV       /* 0xBF82720C */
  .extern SPI2STAT         /* 0xBF827210 */
  .extern SPI2STATCLR      /* 0xBF827214 */
  .extern SPI2STATSET      /* 0xBF827218 */
  .extern SPI2STATINV      /* 0xBF82721C */
  .extern SPI2BUF          /* 0xBF827220 */
  .extern SPI2BRG          /* 0xBF827230 */
  .extern SPI2BRGCLR       /* 0xBF827234 */
  .extern SPI2BRGSET       /* 0xBF827238 */
  .extern SPI2BRGINV       /* 0xBF82723C */
  .extern SPI2CON2         /* 0xBF827240 */
  .extern SPI2CON2CLR      /* 0xBF827244 */
  .extern SPI2CON2SET      /* 0xBF827248 */
  .extern SPI2CON2INV      /* 0xBF82724C */
  .extern U1MODE           /* 0xBF828000 */
  .extern U1MODECLR        /* 0xBF828004 */
  .extern U1MODESET        /* 0xBF828008 */
  .extern U1MODEINV        /* 0xBF82800C */
  .extern U1STA            /* 0xBF828010 */
  .extern U1STACLR         /* 0xBF828014 */
  .extern U1STASET         /* 0xBF828018 */
  .extern U1STAINV         /* 0xBF82801C */
  .extern U1TXREG          /* 0xBF828020 */
  .extern U1RXREG          /* 0xBF828030 */
  .extern U1BRG            /* 0xBF828040 */
  .extern U1BRGCLR         /* 0xBF828044 */
  .extern U1BRGSET         /* 0xBF828048 */
  .extern U1BRGINV         /* 0xBF82804C */
  .extern U2MODE           /* 0xBF828200 */
  .extern U2MODECLR        /* 0xBF828204 */
  .extern U2MODESET        /* 0xBF828208 */
  .extern U2MODEINV        /* 0xBF82820C */
  .extern U2STA            /* 0xBF828210 */
  .extern U2STACLR         /* 0xBF828214 */
  .extern U2STASET         /* 0xBF828218 */
  .extern U2STAINV         /* 0xBF82821C */
  .extern U2TXREG          /* 0xBF828220 */
  .extern U2RXREG          /* 0xBF828230 */
  .extern U2BRG            /* 0xBF828240 */
  .extern U2BRGCLR         /* 0xBF828244 */
  .extern U2BRGSET         /* 0xBF828248 */
  .extern U2BRGINV         /* 0xBF82824C */
  .extern PTCON            /* 0xBF82A000 */
  .extern PTCONCLR         /* 0xBF82A004 */
  .extern PTCONSET         /* 0xBF82A008 */
  .extern PTCONINV         /* 0xBF82A00C */
  .extern PTPER            /* 0xBF82A010 */
  .extern PTPERCLR         /* 0xBF82A014 */
  .extern PTPERSET         /* 0xBF82A018 */
  .extern PTPERINV         /* 0xBF82A01C */
  .extern SEVTCMP          /* 0xBF82A020 */
  .extern SEVTCMPCLR       /* 0xBF82A024 */
  .extern SEVTCMPSET       /* 0xBF82A028 */
  .extern SEVTCMPINV       /* 0xBF82A02C */
  .extern PMTMR            /* 0xBF82A030 */
  .extern PMTMRCLR         /* 0xBF82A034 */
  .extern PMTMRSET         /* 0xBF82A038 */
  .extern PMTMRINV         /* 0xBF82A03C */
  .extern STCON            /* 0xBF82A040 */
  .extern STCONCLR         /* 0xBF82A044 */
  .extern STCONSET         /* 0xBF82A048 */
  .extern STCONINV         /* 0xBF82A04C */
  .extern STPER            /* 0xBF82A050 */
  .extern STPERCLR         /* 0xBF82A054 */
  .extern STPERSET         /* 0xBF82A058 */
  .extern STPERINV         /* 0xBF82A05C */
  .extern SSEVTCMP         /* 0xBF82A060 */
  .extern SSEVTCMPCLR      /* 0xBF82A064 */
  .extern SSEVTCMPSET      /* 0xBF82A068 */
  .extern SSEVTCMPINV      /* 0xBF82A06C */
  .extern SMTMR            /* 0xBF82A070 */
  .extern SMTMRCLR         /* 0xBF82A074 */
  .extern SMTMRSET         /* 0xBF82A078 */
  .extern SMTMRINV         /* 0xBF82A07C */
  .extern CHOP             /* 0xBF82A080 */
  .extern CHOPCLR          /* 0xBF82A084 */
  .extern CHOPSET          /* 0xBF82A088 */
  .extern CHOPINV          /* 0xBF82A08C */
  .extern PWMKEY           /* 0xBF82A090 */
  .extern PWMKEYCLR        /* 0xBF82A094 */
  .extern PWMKEYSET        /* 0xBF82A098 */
  .extern PWMKEYINV        /* 0xBF82A09C */
  .extern PWMCON1          /* 0xBF82A0C0 */
  .extern PWMCON1CLR       /* 0xBF82A0C4 */
  .extern PWMCON1SET       /* 0xBF82A0C8 */
  .extern PWMCON1INV       /* 0xBF82A0CC */
  .extern IOCON1           /* 0xBF82A0D0 */
  .extern IOCON1CLR        /* 0xBF82A0D4 */
  .extern IOCON1SET        /* 0xBF82A0D8 */
  .extern IOCON1INV        /* 0xBF82A0DC */
  .extern PDC1             /* 0xBF82A0E0 */
  .extern PDC1CLR          /* 0xBF82A0E4 */
  .extern PDC1SET          /* 0xBF82A0E8 */
  .extern PDC1INV          /* 0xBF82A0EC */
  .extern SDC1             /* 0xBF82A0F0 */
  .extern SDC1CLR          /* 0xBF82A0F4 */
  .extern SDC1SET          /* 0xBF82A0F8 */
  .extern SDC1INV          /* 0xBF82A0FC */
  .extern PHASE1           /* 0xBF82A100 */
  .extern PHASE1CLR        /* 0xBF82A104 */
  .extern PHASE1SET        /* 0xBF82A108 */
  .extern PHASE1INV        /* 0xBF82A10C */
  .extern DTR1             /* 0xBF82A110 */
  .extern DTR1CLR          /* 0xBF82A114 */
  .extern DTR1SET          /* 0xBF82A118 */
  .extern DTR1INV          /* 0xBF82A11C */
  .extern ALTDTR1          /* 0xBF82A120 */
  .extern ALTDTR1CLR       /* 0xBF82A124 */
  .extern ALTDTR1SET       /* 0xBF82A128 */
  .extern ALTDTR1INV       /* 0xBF82A12C */
  .extern DTCOMP1          /* 0xBF82A130 */
  .extern DTCOMP1CLR       /* 0xBF82A134 */
  .extern DTCOMP1SET       /* 0xBF82A138 */
  .extern DTCOMP1INV       /* 0xBF82A13C */
  .extern TRIG1            /* 0xBF82A140 */
  .extern TRIG1CLR         /* 0xBF82A144 */
  .extern TRIG1SET         /* 0xBF82A148 */
  .extern TRIG1INV         /* 0xBF82A14C */
  .extern TRGCON1          /* 0xBF82A150 */
  .extern TRGCON1CLR       /* 0xBF82A154 */
  .extern TRGCON1SET       /* 0xBF82A158 */
  .extern TRGCON1INV       /* 0xBF82A15C */
  .extern STRIG1           /* 0xBF82A160 */
  .extern STRIG1CLR        /* 0xBF82A164 */
  .extern STRIG1SET        /* 0xBF82A168 */
  .extern STRIG1INV        /* 0xBF82A16C */
  .extern CAP1             /* 0xBF82A170 */
  .extern CAP1CLR          /* 0xBF82A174 */
  .extern CAP1SET          /* 0xBF82A178 */
  .extern CAP1INV          /* 0xBF82A17C */
  .extern LEBCON1          /* 0xBF82A180 */
  .extern LEBCON1CLR       /* 0xBF82A184 */
  .extern LEBCON1SET       /* 0xBF82A188 */
  .extern LEBCON1INV       /* 0xBF82A18C */
  .extern LEBDLY1          /* 0xBF82A190 */
  .extern LEBDLY1CLR       /* 0xBF82A194 */
  .extern LEBDLY1SET       /* 0xBF82A198 */
  .extern LEBDLY1INV       /* 0xBF82A19C */
  .extern AUXCON1          /* 0xBF82A1A0 */
  .extern AUXCON1CLR       /* 0xBF82A1A4 */
  .extern AUXCON1SET       /* 0xBF82A1A8 */
  .extern AUXCON1INV       /* 0xBF82A1AC */
  .extern PTMR1            /* 0xBF82A1B0 */
  .extern PTMR1CLR         /* 0xBF82A1B4 */
  .extern PTMR1SET         /* 0xBF82A1B8 */
  .extern PTMR1INV         /* 0xBF82A1BC */
  .extern PWMCON2          /* 0xBF82A1C0 */
  .extern PWMCON2CLR       /* 0xBF82A1C4 */
  .extern PWMCON2SET       /* 0xBF82A1C8 */
  .extern PWMCON2INV       /* 0xBF82A1CC */
  .extern IOCON2           /* 0xBF82A1D0 */
  .extern IOCON2CLR        /* 0xBF82A1D4 */
  .extern IOCON2SET        /* 0xBF82A1D8 */
  .extern IOCON2INV        /* 0xBF82A1DC */
  .extern PDC2             /* 0xBF82A1E0 */
  .extern PDC2CLR          /* 0xBF82A1E4 */
  .extern PDC2SET          /* 0xBF82A1E8 */
  .extern PDC2INV          /* 0xBF82A1EC */
  .extern SDC2             /* 0xBF82A1F0 */
  .extern SDC2CLR          /* 0xBF82A1F4 */
  .extern SDC2SET          /* 0xBF82A1F8 */
  .extern SDC2INV          /* 0xBF82A1FC */
  .extern PHASE2           /* 0xBF82A200 */
  .extern PHASE2CLR        /* 0xBF82A204 */
  .extern PHASE2SET        /* 0xBF82A208 */
  .extern PHASE2INV        /* 0xBF82A20C */
  .extern DTR2             /* 0xBF82A210 */
  .extern DTR2CLR          /* 0xBF82A214 */
  .extern DTR2SET          /* 0xBF82A218 */
  .extern DTR2INV          /* 0xBF82A21C */
  .extern ALTDTR2          /* 0xBF82A220 */
  .extern ALTDTR2CLR       /* 0xBF82A224 */
  .extern ALTDTR2SET       /* 0xBF82A228 */
  .extern ALTDTR2INV       /* 0xBF82A22C */
  .extern DTCOMP2          /* 0xBF82A230 */
  .extern DTCOMP2CLR       /* 0xBF82A234 */
  .extern DTCOMP2SET       /* 0xBF82A238 */
  .extern DTCOMP2INV       /* 0xBF82A23C */
  .extern TRIG2            /* 0xBF82A240 */
  .extern TRIG2CLR         /* 0xBF82A244 */
  .extern TRIG2SET         /* 0xBF82A248 */
  .extern TRIG2INV         /* 0xBF82A24C */
  .extern TRGCON2          /* 0xBF82A250 */
  .extern TRGCON2CLR       /* 0xBF82A254 */
  .extern TRGCON2SET       /* 0xBF82A258 */
  .extern TRGCON2INV       /* 0xBF82A25C */
  .extern STRIG2           /* 0xBF82A260 */
  .extern STRIG2CLR        /* 0xBF82A264 */
  .extern STRIG2SET        /* 0xBF82A268 */
  .extern STRIG2INV        /* 0xBF82A26C */
  .extern CAP2             /* 0xBF82A270 */
  .extern CAP2CLR          /* 0xBF82A274 */
  .extern CAP2SET          /* 0xBF82A278 */
  .extern CAP2INV          /* 0xBF82A27C */
  .extern LEBCON2          /* 0xBF82A280 */
  .extern LEBCON2CLR       /* 0xBF82A284 */
  .extern LEBCON2SET       /* 0xBF82A288 */
  .extern LEBCON2INV       /* 0xBF82A28C */
  .extern LEBDLY2          /* 0xBF82A290 */
  .extern LEBDLY2CLR       /* 0xBF82A294 */
  .extern LEBDLY2SET       /* 0xBF82A298 */
  .extern LEBDLY2INV       /* 0xBF82A29C */
  .extern AUXCON2          /* 0xBF82A2A0 */
  .extern AUXCON2CLR       /* 0xBF82A2A4 */
  .extern AUXCON2SET       /* 0xBF82A2A8 */
  .extern AUXCON2INV       /* 0xBF82A2AC */
  .extern PTMR2            /* 0xBF82A2B0 */
  .extern PTMR2CLR         /* 0xBF82A2B4 */
  .extern PTMR2SET         /* 0xBF82A2B8 */
  .extern PTMR2INV         /* 0xBF82A2BC */
  .extern PWMCON3          /* 0xBF82A2C0 */
  .extern PWMCON3CLR       /* 0xBF82A2C4 */
  .extern PWMCON3SET       /* 0xBF82A2C8 */
  .extern PWMCON3INV       /* 0xBF82A2CC */
  .extern IOCON3           /* 0xBF82A2D0 */
  .extern IOCON3CLR        /* 0xBF82A2D4 */
  .extern IOCON3SET        /* 0xBF82A2D8 */
  .extern IOCON3INV        /* 0xBF82A2DC */
  .extern PDC3             /* 0xBF82A2E0 */
  .extern PDC3CLR          /* 0xBF82A2E4 */
  .extern PDC3SET          /* 0xBF82A2E8 */
  .extern PDC3INV          /* 0xBF82A2EC */
  .extern SDC3             /* 0xBF82A2F0 */
  .extern SDC3CLR          /* 0xBF82A2F4 */
  .extern SDC3SET          /* 0xBF82A2F8 */
  .extern SDC3INV          /* 0xBF82A2FC */
  .extern PHASE3           /* 0xBF82A300 */
  .extern PHASE3CLR        /* 0xBF82A304 */
  .extern PHASE3SET        /* 0xBF82A308 */
  .extern PHASE3INV        /* 0xBF82A30C */
  .extern DTR3             /* 0xBF82A310 */
  .extern DTR3CLR          /* 0xBF82A314 */
  .extern DTR3SET          /* 0xBF82A318 */
  .extern DTR3INV          /* 0xBF82A31C */
  .extern ALTDTR3          /* 0xBF82A320 */
  .extern ALTDTR3CLR       /* 0xBF82A324 */
  .extern ALTDTR3SET       /* 0xBF82A328 */
  .extern ALTDTR3INV       /* 0xBF82A32C */
  .extern DTCOMP3          /* 0xBF82A330 */
  .extern DTCOMP3CLR       /* 0xBF82A334 */
  .extern DTCOMP3SET       /* 0xBF82A338 */
  .extern DTCOMP3INV       /* 0xBF82A33C */
  .extern TRIG3            /* 0xBF82A340 */
  .extern TRIG3CLR         /* 0xBF82A344 */
  .extern TRIG3SET         /* 0xBF82A348 */
  .extern TRIG3INV         /* 0xBF82A34C */
  .extern TRGCON3          /* 0xBF82A350 */
  .extern TRGCON3CLR       /* 0xBF82A354 */
  .extern TRGCON3SET       /* 0xBF82A358 */
  .extern TRGCON3INV       /* 0xBF82A35C */
  .extern STRIG3           /* 0xBF82A360 */
  .extern STRIG3CLR        /* 0xBF82A364 */
  .extern STRIG3SET        /* 0xBF82A368 */
  .extern STRIG3INV        /* 0xBF82A36C */
  .extern CAP3             /* 0xBF82A370 */
  .extern CAP3CLR          /* 0xBF82A374 */
  .extern CAP3SET          /* 0xBF82A378 */
  .extern CAP3INV          /* 0xBF82A37C */
  .extern LEBCON3          /* 0xBF82A380 */
  .extern LEBCON3CLR       /* 0xBF82A384 */
  .extern LEBCON3SET       /* 0xBF82A388 */
  .extern LEBCON3INV       /* 0xBF82A38C */
  .extern LEBDLY3          /* 0xBF82A390 */
  .extern LEBDLY3CLR       /* 0xBF82A394 */
  .extern LEBDLY3SET       /* 0xBF82A398 */
  .extern LEBDLY3INV       /* 0xBF82A39C */
  .extern AUXCON3          /* 0xBF82A3A0 */
  .extern AUXCON3CLR       /* 0xBF82A3A4 */
  .extern AUXCON3SET       /* 0xBF82A3A8 */
  .extern AUXCON3INV       /* 0xBF82A3AC */
  .extern PTMR3            /* 0xBF82A3B0 */
  .extern PTMR3CLR         /* 0xBF82A3B4 */
  .extern PTMR3SET         /* 0xBF82A3B8 */
  .extern PTMR3INV         /* 0xBF82A3BC */
  .extern PWMCON4          /* 0xBF82A3C0 */
  .extern PWMCON4CLR       /* 0xBF82A3C4 */
  .extern PWMCON4SET       /* 0xBF82A3C8 */
  .extern PWMCON4INV       /* 0xBF82A3CC */
  .extern IOCON4           /* 0xBF82A3D0 */
  .extern IOCON4CLR        /* 0xBF82A3D4 */
  .extern IOCON4SET        /* 0xBF82A3D8 */
  .extern IOCON4INV        /* 0xBF82A3DC */
  .extern PDC4             /* 0xBF82A3E0 */
  .extern PDC4CLR          /* 0xBF82A3E4 */
  .extern PDC4SET          /* 0xBF82A3E8 */
  .extern PDC4INV          /* 0xBF82A3EC */
  .extern SDC4             /* 0xBF82A3F0 */
  .extern SDC4CLR          /* 0xBF82A3F4 */
  .extern SDC4SET          /* 0xBF82A3F8 */
  .extern SDC4INV          /* 0xBF82A3FC */
  .extern PHASE4           /* 0xBF82A400 */
  .extern PHASE4CLR        /* 0xBF82A404 */
  .extern PHASE4SET        /* 0xBF82A408 */
  .extern PHASE4INV        /* 0xBF82A40C */
  .extern DTR4             /* 0xBF82A410 */
  .extern DTR4CLR          /* 0xBF82A414 */
  .extern DTR4SET          /* 0xBF82A418 */
  .extern DTR4INV          /* 0xBF82A41C */
  .extern ALTDTR4          /* 0xBF82A420 */
  .extern ALTDTR4CLR       /* 0xBF82A424 */
  .extern ALTDTR4SET       /* 0xBF82A428 */
  .extern ALTDTR4INV       /* 0xBF82A42C */
  .extern DTCOMP4          /* 0xBF82A430 */
  .extern DTCOMP4CLR       /* 0xBF82A434 */
  .extern DTCOMP4SET       /* 0xBF82A438 */
  .extern DTCOMP4INV       /* 0xBF82A43C */
  .extern TRIG4            /* 0xBF82A440 */
  .extern TRIG4CLR         /* 0xBF82A444 */
  .extern TRIG4SET         /* 0xBF82A448 */
  .extern TRIG4INV         /* 0xBF82A44C */
  .extern TRGCON4          /* 0xBF82A450 */
  .extern TRGCON4CLR       /* 0xBF82A454 */
  .extern TRGCON4SET       /* 0xBF82A458 */
  .extern TRGCON4INV       /* 0xBF82A45C */
  .extern STRIG4           /* 0xBF82A460 */
  .extern STRIG4CLR        /* 0xBF82A464 */
  .extern STRIG4SET        /* 0xBF82A468 */
  .extern STRIG4INV        /* 0xBF82A46C */
  .extern CAP4             /* 0xBF82A470 */
  .extern CAP4CLR          /* 0xBF82A474 */
  .extern CAP4SET          /* 0xBF82A478 */
  .extern CAP4INV          /* 0xBF82A47C */
  .extern LEBCON4          /* 0xBF82A480 */
  .extern LEBCON4CLR       /* 0xBF82A484 */
  .extern LEBCON4SET       /* 0xBF82A488 */
  .extern LEBCON4INV       /* 0xBF82A48C */
  .extern LEBDLY4          /* 0xBF82A490 */
  .extern LEBDLY4CLR       /* 0xBF82A494 */
  .extern LEBDLY4SET       /* 0xBF82A498 */
  .extern LEBDLY4INV       /* 0xBF82A49C */
  .extern AUXCON4          /* 0xBF82A4A0 */
  .extern AUXCON4CLR       /* 0xBF82A4A4 */
  .extern AUXCON4SET       /* 0xBF82A4A8 */
  .extern AUXCON4INV       /* 0xBF82A4AC */
  .extern PTMR4            /* 0xBF82A4B0 */
  .extern PTMR4CLR         /* 0xBF82A4B4 */
  .extern PTMR4SET         /* 0xBF82A4B8 */
  .extern PTMR4INV         /* 0xBF82A4BC */
  .extern QEI1CON          /* 0xBF82B200 */
  .extern QEI1CONCLR       /* 0xBF82B204 */
  .extern QEI1CONSET       /* 0xBF82B208 */
  .extern QEI1CONINV       /* 0xBF82B20C */
  .extern QEI1IOC          /* 0xBF82B210 */
  .extern QEI1IOCCLR       /* 0xBF82B214 */
  .extern QEI1IOCSET       /* 0xBF82B218 */
  .extern QEI1IOCINV       /* 0xBF82B21C */
  .extern QEI1STAT         /* 0xBF82B220 */
  .extern QEI1STATCLR      /* 0xBF82B224 */
  .extern QEI1STATSET      /* 0xBF82B228 */
  .extern QEI1STATINV      /* 0xBF82B22C */
  .extern POS1CNT          /* 0xBF82B230 */
  .extern POS1CNTCLR       /* 0xBF82B234 */
  .extern POS1CNTSET       /* 0xBF82B238 */
  .extern POS1CNTINV       /* 0xBF82B23C */
  .extern POS1HLD          /* 0xBF82B240 */
