Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
#define _IEC1_I2C1SIE_POSITION                   0x0000000A
#define _IEC1_I2C1SIE_MASK                       0x00000400
#define _IEC1_I2C1SIE_LENGTH                     0x00000001

#define _IEC1_I2C1MIE_POSITION                   0x0000000B
#define _IEC1_I2C1MIE_MASK                       0x00000800
#define _IEC1_I2C1MIE_LENGTH                     0x00000001

#define _IEC1_CNAIE_POSITION                     0x0000000C
#define _IEC1_CNAIE_MASK                         0x00001000
#define _IEC1_CNAIE_LENGTH                       0x00000001

#define _IEC1_CNBIE_POSITION                     0x0000000D
#define _IEC1_CNBIE_MASK                         0x00002000
#define _IEC1_CNBIE_LENGTH                       0x00000001

#define _IEC1_CNCIE_POSITION                     0x0000000E
#define _IEC1_CNCIE_MASK                         0x00004000
#define _IEC1_CNCIE_LENGTH                       0x00000001

#define _IEC1_CNDIE_POSITION                     0x0000000F
#define _IEC1_CNDIE_MASK                         0x00008000
#define _IEC1_CNDIE_LENGTH                       0x00000001

#define _IEC1_SPI2EIE_POSITION                   0x00000015
#define _IEC1_SPI2EIE_MASK                       0x00200000
#define _IEC1_SPI2EIE_LENGTH                     0x00000001

#define _IEC1_SPI2RXIE_POSITION                  0x00000016
#define _IEC1_SPI2RXIE_MASK                      0x00400000
#define _IEC1_SPI2RXIE_LENGTH                    0x00000001

#define _IEC1_SPI2TXIE_POSITION                  0x00000017
#define _IEC1_SPI2TXIE_MASK                      0x00800000
#define _IEC1_SPI2TXIE_LENGTH                    0x00000001

#define _IEC1_U2EIE_POSITION                     0x00000018
#define _IEC1_U2EIE_MASK                         0x01000000
#define _IEC1_U2EIE_LENGTH                       0x00000001

#define _IEC1_U2RXIE_POSITION                    0x00000019
#define _IEC1_U2RXIE_MASK                        0x02000000
#define _IEC1_U2RXIE_LENGTH                      0x00000001

#define _IEC1_U2TXIE_POSITION                    0x0000001A
#define _IEC1_U2TXIE_MASK                        0x04000000
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC1_I2C2BIE_POSITION                   0x0000001B
#define _IEC1_I2C2BIE_MASK                       0x08000000
#define _IEC1_I2C2BIE_LENGTH                     0x00000001

#define _IEC1_I2C2SIE_POSITION                   0x0000001C
#define _IEC1_I2C2SIE_MASK                       0x10000000
#define _IEC1_I2C2SIE_LENGTH                     0x00000001

#define _IEC1_I2C2MIE_POSITION                   0x0000001D
#define _IEC1_I2C2MIE_MASK                       0x20000000
#define _IEC1_I2C2MIE_LENGTH                     0x00000001

#define _IEC1_w_POSITION                         0x00000000
#define _IEC1_w_MASK                             0xFFFFFFFF
#define _IEC1_w_LENGTH                           0x00000020

#define _IEC2_CTMUIE_POSITION                    0x00000007
#define _IEC2_CTMUIE_MASK                        0x00000080
#define _IEC2_CTMUIE_LENGTH                      0x00000001

#define _IEC2_DMA0IE_POSITION                    0x00000008
#define _IEC2_DMA0IE_MASK                        0x00000100
#define _IEC2_DMA0IE_LENGTH                      0x00000001

#define _IEC2_DMA1IE_POSITION                    0x00000009
#define _IEC2_DMA1IE_MASK                        0x00000200
#define _IEC2_DMA1IE_LENGTH                      0x00000001

#define _IEC2_DMA2IE_POSITION                    0x0000000A
#define _IEC2_DMA2IE_MASK                        0x00000400
#define _IEC2_DMA2IE_LENGTH                      0x00000001

#define _IEC2_DMA3IE_POSITION                    0x0000000B
#define _IEC2_DMA3IE_MASK                        0x00000800
#define _IEC2_DMA3IE_LENGTH                      0x00000001

#define _IEC2_AD1IE_POSITION                     0x0000001C
#define _IEC2_AD1IE_MASK                         0x10000000
#define _IEC2_AD1IE_LENGTH                       0x00000001

#define _IEC2_AD1DC1IE_POSITION                  0x0000001E
#define _IEC2_AD1DC1IE_MASK                      0x40000000
#define _IEC2_AD1DC1IE_LENGTH                    0x00000001

#define _IEC2_AD1DC2IE_POSITION                  0x0000001F
#define _IEC2_AD1DC2IE_MASK                      0x80000000
#define _IEC2_AD1DC2IE_LENGTH                    0x00000001

#define _IEC2_w_POSITION                         0x00000000
#define _IEC2_w_MASK                             0xFFFFFFFF
#define _IEC2_w_LENGTH                           0x00000020

#define _IEC3_AD1DF1IE_POSITION                  0x00000000
#define _IEC3_AD1DF1IE_MASK                      0x00000001
#define _IEC3_AD1DF1IE_LENGTH                    0x00000001

#define _IEC3_AD1DF2IE_POSITION                  0x00000001
#define _IEC3_AD1DF2IE_MASK                      0x00000002
#define _IEC3_AD1DF2IE_LENGTH                    0x00000001

#define _IEC3_AD1FIIE_POSITION                   0x00000004
#define _IEC3_AD1FIIE_MASK                       0x00000010
#define _IEC3_AD1FIIE_LENGTH                     0x00000001

#define _IEC3_AD1EOSIE_POSITION                  0x00000005
#define _IEC3_AD1EOSIE_MASK                      0x00000020
#define _IEC3_AD1EOSIE_LENGTH                    0x00000001

#define _IEC3_AD1ARIE_POSITION                   0x00000006
#define _IEC3_AD1ARIE_MASK                       0x00000040
#define _IEC3_AD1ARIE_LENGTH                     0x00000001

#define _IEC3_AD1RSIE_POSITION                   0x00000007
#define _IEC3_AD1RSIE_MASK                       0x00000080
#define _IEC3_AD1RSIE_LENGTH                     0x00000001

#define _IEC3_AD1FCBTIE_POSITION                 0x00000008
#define _IEC3_AD1FCBTIE_MASK                     0x00000100
#define _IEC3_AD1FCBTIE_LENGTH                   0x00000001

#define _IEC3_AD1GIE_POSITION                    0x00000009
#define _IEC3_AD1GIE_MASK                        0x00000200
#define _IEC3_AD1GIE_LENGTH                      0x00000001

#define _IEC3_AD1D0IE_POSITION                   0x0000000A
#define _IEC3_AD1D0IE_MASK                       0x00000400
#define _IEC3_AD1D0IE_LENGTH                     0x00000001

#define _IEC3_AD1D1IE_POSITION                   0x0000000B
#define _IEC3_AD1D1IE_MASK                       0x00000800
#define _IEC3_AD1D1IE_LENGTH                     0x00000001

#define _IEC3_AD1D2IE_POSITION                   0x0000000C
#define _IEC3_AD1D2IE_MASK                       0x00001000
#define _IEC3_AD1D2IE_LENGTH                     0x00000001

