Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
#define _IEC3_AD1D3IE_POSITION                   0x0000000D
#define _IEC3_AD1D3IE_MASK                       0x00002000
#define _IEC3_AD1D3IE_LENGTH                     0x00000001

#define _IEC3_AD1D4IE_POSITION                   0x0000000E
#define _IEC3_AD1D4IE_MASK                       0x00004000
#define _IEC3_AD1D4IE_LENGTH                     0x00000001

#define _IEC3_AD1D5IE_POSITION                   0x0000000F
#define _IEC3_AD1D5IE_MASK                       0x00008000
#define _IEC3_AD1D5IE_LENGTH                     0x00000001

#define _IEC3_AD1D6IE_POSITION                   0x00000010
#define _IEC3_AD1D6IE_MASK                       0x00010000
#define _IEC3_AD1D6IE_LENGTH                     0x00000001

#define _IEC3_AD1D7IE_POSITION                   0x00000011
#define _IEC3_AD1D7IE_MASK                       0x00020000
#define _IEC3_AD1D7IE_LENGTH                     0x00000001

#define _IEC3_AD1D8IE_POSITION                   0x00000012
#define _IEC3_AD1D8IE_MASK                       0x00040000
#define _IEC3_AD1D8IE_LENGTH                     0x00000001

#define _IEC3_AD1D9IE_POSITION                   0x00000013
#define _IEC3_AD1D9IE_MASK                       0x00080000
#define _IEC3_AD1D9IE_LENGTH                     0x00000001

#define _IEC3_AD1D10IE_POSITION                  0x00000014
#define _IEC3_AD1D10IE_MASK                      0x00100000
#define _IEC3_AD1D10IE_LENGTH                    0x00000001

#define _IEC3_AD1D11IE_POSITION                  0x00000015
#define _IEC3_AD1D11IE_MASK                      0x00200000
#define _IEC3_AD1D11IE_LENGTH                    0x00000001

#define _IEC3_AD1D12IE_POSITION                  0x00000016
#define _IEC3_AD1D12IE_MASK                      0x00400000
#define _IEC3_AD1D12IE_LENGTH                    0x00000001

#define _IEC3_AD1D13IE_POSITION                  0x00000017
#define _IEC3_AD1D13IE_MASK                      0x00800000
#define _IEC3_AD1D13IE_LENGTH                    0x00000001

#define _IEC3_AD1D14IE_POSITION                  0x00000018
#define _IEC3_AD1D14IE_MASK                      0x01000000
#define _IEC3_AD1D14IE_LENGTH                    0x00000001

#define _IEC3_AD1D15IE_POSITION                  0x00000019
#define _IEC3_AD1D15IE_MASK                      0x02000000
#define _IEC3_AD1D15IE_LENGTH                    0x00000001

#define _IEC3_AD1D16IE_POSITION                  0x0000001A
#define _IEC3_AD1D16IE_MASK                      0x04000000
#define _IEC3_AD1D16IE_LENGTH                    0x00000001

#define _IEC3_AD1D17IE_POSITION                  0x0000001B
#define _IEC3_AD1D17IE_MASK                      0x08000000
#define _IEC3_AD1D17IE_LENGTH                    0x00000001

#define _IEC3_w_POSITION                         0x00000000
#define _IEC3_w_MASK                             0xFFFFFFFF
#define _IEC3_w_LENGTH                           0x00000020

#define _IEC4_AD1D50IE_POSITION                  0x0000001C
#define _IEC4_AD1D50IE_MASK                      0x10000000
#define _IEC4_AD1D50IE_LENGTH                    0x00000001

#define _IEC4_AD1D53IE_POSITION                  0x0000001F
#define _IEC4_AD1D53IE_MASK                      0x80000000
#define _IEC4_AD1D53IE_LENGTH                    0x00000001

#define _IEC4_w_POSITION                         0x00000000
#define _IEC4_w_MASK                             0xFFFFFFFF
#define _IEC4_w_LENGTH                           0x00000020

#define _IEC5_CMP3IE_POSITION                    0x00000000
#define _IEC5_CMP3IE_MASK                        0x00000001
#define _IEC5_CMP3IE_LENGTH                      0x00000001

#define _IEC5_QEI1IE_POSITION                    0x00000009
#define _IEC5_QEI1IE_MASK                        0x00000200
#define _IEC5_QEI1IE_LENGTH                      0x00000001

#define _IEC5_QEI2IE_POSITION                    0x0000000A
#define _IEC5_QEI2IE_MASK                        0x00000400
#define _IEC5_QEI2IE_LENGTH                      0x00000001

#define _IEC5_PWMPEVTIE_POSITION                 0x0000000B
#define _IEC5_PWMPEVTIE_MASK                     0x00000800
#define _IEC5_PWMPEVTIE_LENGTH                   0x00000001

#define _IEC5_PWMSEVTIE_POSITION                 0x0000000C
#define _IEC5_PWMSEVTIE_MASK                     0x00001000
#define _IEC5_PWMSEVTIE_LENGTH                   0x00000001

#define _IEC5_PWM1IE_POSITION                    0x0000000D
#define _IEC5_PWM1IE_MASK                        0x00002000
#define _IEC5_PWM1IE_LENGTH                      0x00000001

#define _IEC5_PWM2IE_POSITION                    0x0000000E
#define _IEC5_PWM2IE_MASK                        0x00004000
#define _IEC5_PWM2IE_LENGTH                      0x00000001

#define _IEC5_PWM3IE_POSITION                    0x0000000F
#define _IEC5_PWM3IE_MASK                        0x00008000
#define _IEC5_PWM3IE_LENGTH                      0x00000001

#define _IEC5_PWM4IE_POSITION                    0x00000010
#define _IEC5_PWM4IE_MASK                        0x00010000
#define _IEC5_PWM4IE_LENGTH                      0x00000001

#define _IEC5_DMA4IE_POSITION                    0x00000016
#define _IEC5_DMA4IE_MASK                        0x00400000
#define _IEC5_DMA4IE_LENGTH                      0x00000001

#define _IEC5_DMA5IE_POSITION                    0x00000017
#define _IEC5_DMA5IE_MASK                        0x00800000
#define _IEC5_DMA5IE_LENGTH                      0x00000001

#define _IEC5_DMA6IE_POSITION                    0x00000018
#define _IEC5_DMA6IE_MASK                        0x01000000
#define _IEC5_DMA6IE_LENGTH                      0x00000001

#define _IEC5_DMA7IE_POSITION                    0x00000019
#define _IEC5_DMA7IE_MASK                        0x02000000
#define _IEC5_DMA7IE_LENGTH                      0x00000001

#define _IEC5_w_POSITION                         0x00000000
#define _IEC5_w_MASK                             0xFFFFFFFF
#define _IEC5_w_LENGTH                           0x00000020

#define _IEC7_SBIE_POSITION                      0x00000006
#define _IEC7_SBIE_MASK                          0x00000040
#define _IEC7_SBIE_LENGTH                        0x00000001

#define _IEC7_PCACHEIE_POSITION                  0x00000017
#define _IEC7_PCACHEIE_MASK                      0x00800000
#define _IEC7_PCACHEIE_LENGTH                    0x00000001

#define _IEC7_CLC1IE_POSITION                    0x00000019
#define _IEC7_CLC1IE_MASK                        0x02000000
#define _IEC7_CLC1IE_LENGTH                      0x00000001

#define _IEC7_CPCIE_POSITION                     0x0000001E
#define _IEC7_CPCIE_MASK                         0x40000000
#define _IEC7_CPCIE_LENGTH                       0x00000001

