Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
#define _IPC9_w_POSITION                         0x00000000
#define _IPC9_w_MASK                             0xFFFFFFFF
#define _IPC9_w_LENGTH                           0x00000020

#define _IPC10_U1TXIS_POSITION                   0x00000000
#define _IPC10_U1TXIS_MASK                       0x00000003
#define _IPC10_U1TXIS_LENGTH                     0x00000002

#define _IPC10_U1TXIP_POSITION                   0x00000002
#define _IPC10_U1TXIP_MASK                       0x0000001C
#define _IPC10_U1TXIP_LENGTH                     0x00000003

#define _IPC10_I2C1BIS_POSITION                  0x00000008
#define _IPC10_I2C1BIS_MASK                      0x00000300
#define _IPC10_I2C1BIS_LENGTH                    0x00000002

#define _IPC10_I2C1BIP_POSITION                  0x0000000A
#define _IPC10_I2C1BIP_MASK                      0x00001C00
#define _IPC10_I2C1BIP_LENGTH                    0x00000003

#define _IPC10_I2C1SIS_POSITION                  0x00000010
#define _IPC10_I2C1SIS_MASK                      0x00030000
#define _IPC10_I2C1SIS_LENGTH                    0x00000002

#define _IPC10_I2C1SIP_POSITION                  0x00000012
#define _IPC10_I2C1SIP_MASK                      0x001C0000
#define _IPC10_I2C1SIP_LENGTH                    0x00000003

#define _IPC10_I2C1MIS_POSITION                  0x00000018
#define _IPC10_I2C1MIS_MASK                      0x03000000
#define _IPC10_I2C1MIS_LENGTH                    0x00000002

#define _IPC10_I2C1MIP_POSITION                  0x0000001A
#define _IPC10_I2C1MIP_MASK                      0x1C000000
#define _IPC10_I2C1MIP_LENGTH                    0x00000003

#define _IPC10_w_POSITION                        0x00000000
#define _IPC10_w_MASK                            0xFFFFFFFF
#define _IPC10_w_LENGTH                          0x00000020

#define _IPC11_CNAIS_POSITION                    0x00000000
#define _IPC11_CNAIS_MASK                        0x00000003
#define _IPC11_CNAIS_LENGTH                      0x00000002

#define _IPC11_CNAIP_POSITION                    0x00000002
#define _IPC11_CNAIP_MASK                        0x0000001C
#define _IPC11_CNAIP_LENGTH                      0x00000003

#define _IPC11_CNBIS_POSITION                    0x00000008
#define _IPC11_CNBIS_MASK                        0x00000300
#define _IPC11_CNBIS_LENGTH                      0x00000002

#define _IPC11_CNBIP_POSITION                    0x0000000A
#define _IPC11_CNBIP_MASK                        0x00001C00
#define _IPC11_CNBIP_LENGTH                      0x00000003

#define _IPC11_CNCIS_POSITION                    0x00000010
#define _IPC11_CNCIS_MASK                        0x00030000
#define _IPC11_CNCIS_LENGTH                      0x00000002

#define _IPC11_CNCIP_POSITION                    0x00000012
#define _IPC11_CNCIP_MASK                        0x001C0000
#define _IPC11_CNCIP_LENGTH                      0x00000003

#define _IPC11_CNDIS_POSITION                    0x00000018
#define _IPC11_CNDIS_MASK                        0x03000000
#define _IPC11_CNDIS_LENGTH                      0x00000002

#define _IPC11_CNDIP_POSITION                    0x0000001A
#define _IPC11_CNDIP_MASK                        0x1C000000
#define _IPC11_CNDIP_LENGTH                      0x00000003

#define _IPC11_w_POSITION                        0x00000000
#define _IPC11_w_MASK                            0xFFFFFFFF
#define _IPC11_w_LENGTH                          0x00000020

#define _IPC13_SPI2EIS_POSITION                  0x00000008
#define _IPC13_SPI2EIS_MASK                      0x00000300
#define _IPC13_SPI2EIS_LENGTH                    0x00000002

#define _IPC13_SPI2EIP_POSITION                  0x0000000A
#define _IPC13_SPI2EIP_MASK                      0x00001C00
#define _IPC13_SPI2EIP_LENGTH                    0x00000003

#define _IPC13_SPI2RXIS_POSITION                 0x00000010
#define _IPC13_SPI2RXIS_MASK                     0x00030000
#define _IPC13_SPI2RXIS_LENGTH                   0x00000002

#define _IPC13_SPI2RXIP_POSITION                 0x00000012
#define _IPC13_SPI2RXIP_MASK                     0x001C0000
#define _IPC13_SPI2RXIP_LENGTH                   0x00000003

#define _IPC13_SPI2TXIS_POSITION                 0x00000018
#define _IPC13_SPI2TXIS_MASK                     0x03000000
#define _IPC13_SPI2TXIS_LENGTH                   0x00000002

#define _IPC13_SPI2TXIP_POSITION                 0x0000001A
#define _IPC13_SPI2TXIP_MASK                     0x1C000000
#define _IPC13_SPI2TXIP_LENGTH                   0x00000003

#define _IPC13_w_POSITION                        0x00000000
#define _IPC13_w_MASK                            0xFFFFFFFF
#define _IPC13_w_LENGTH                          0x00000020

#define _IPC14_U2EIS_POSITION                    0x00000000
#define _IPC14_U2EIS_MASK                        0x00000003
#define _IPC14_U2EIS_LENGTH                      0x00000002

#define _IPC14_U2EIP_POSITION                    0x00000002
#define _IPC14_U2EIP_MASK                        0x0000001C
#define _IPC14_U2EIP_LENGTH                      0x00000003

#define _IPC14_U2RXIS_POSITION                   0x00000008
#define _IPC14_U2RXIS_MASK                       0x00000300
#define _IPC14_U2RXIS_LENGTH                     0x00000002

#define _IPC14_U2RXIP_POSITION                   0x0000000A
#define _IPC14_U2RXIP_MASK                       0x00001C00
#define _IPC14_U2RXIP_LENGTH                     0x00000003

#define _IPC14_U2TXIS_POSITION                   0x00000010
#define _IPC14_U2TXIS_MASK                       0x00030000
#define _IPC14_U2TXIS_LENGTH                     0x00000002

#define _IPC14_U2TXIP_POSITION                   0x00000012
#define _IPC14_U2TXIP_MASK                       0x001C0000
#define _IPC14_U2TXIP_LENGTH                     0x00000003

#define _IPC14_I2C2BIS_POSITION                  0x00000018
#define _IPC14_I2C2BIS_MASK                      0x03000000
#define _IPC14_I2C2BIS_LENGTH                    0x00000002

#define _IPC14_I2C2BIP_POSITION                  0x0000001A
#define _IPC14_I2C2BIP_MASK                      0x1C000000
#define _IPC14_I2C2BIP_LENGTH                    0x00000003

#define _IPC14_w_POSITION                        0x00000000
#define _IPC14_w_MASK                            0xFFFFFFFF
#define _IPC14_w_LENGTH                          0x00000020

#define _IPC15_I2C2SIS_POSITION                  0x00000000
#define _IPC15_I2C2SIS_MASK                      0x00000003
#define _IPC15_I2C2SIS_LENGTH                    0x00000002

#define _IPC15_I2C2SIP_POSITION                  0x00000002
#define _IPC15_I2C2SIP_MASK                      0x0000001C
#define _IPC15_I2C2SIP_LENGTH                    0x00000003

#define _IPC15_I2C2MIS_POSITION                  0x00000008
#define _IPC15_I2C2MIS_MASK                      0x00000300
#define _IPC15_I2C2MIS_LENGTH                    0x00000002

#define _IPC15_I2C2MIP_POSITION                  0x0000000A
#define _IPC15_I2C2MIP_MASK                      0x00001C00
#define _IPC15_I2C2MIP_LENGTH                    0x00000003

