Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
#define _CM3CON_OPLPWR_POSITION                  0x0000000C
#define _CM3CON_OPLPWR_MASK                      0x00001000
#define _CM3CON_OPLPWR_LENGTH                    0x00000001

#define _CM3CON_CPOL_POSITION                    0x0000000D
#define _CM3CON_CPOL_MASK                        0x00002000
#define _CM3CON_CPOL_LENGTH                      0x00000001

#define _CM3CON_COE_POSITION                     0x0000000E
#define _CM3CON_COE_MASK                         0x00004000
#define _CM3CON_COE_LENGTH                       0x00000001

#define _CM3CON_ON_POSITION                      0x0000000F
#define _CM3CON_ON_MASK                          0x00008000
#define _CM3CON_ON_LENGTH                        0x00000001

#define _CM3CON_CFDIV_POSITION                   0x00000010
#define _CM3CON_CFDIV_MASK                       0x00070000
#define _CM3CON_CFDIV_LENGTH                     0x00000003

#define _CM3CON_CFLTREN_POSITION                 0x00000013
#define _CM3CON_CFLTREN_MASK                     0x00080000
#define _CM3CON_CFLTREN_LENGTH                   0x00000001

#define _CM3CON_CFSEL_POSITION                   0x00000014
#define _CM3CON_CFSEL_MASK                       0x00700000
#define _CM3CON_CFSEL_LENGTH                     0x00000003

#define _CM3CON_HYSSEL_POSITION                  0x00000018
#define _CM3CON_HYSSEL_MASK                      0x03000000
#define _CM3CON_HYSSEL_LENGTH                    0x00000002

#define _CM3CON_HYSPOL_POSITION                  0x0000001C
#define _CM3CON_HYSPOL_MASK                      0x10000000
#define _CM3CON_HYSPOL_LENGTH                    0x00000001

#define _CM3CON_ENPGA_POSITION                   0x0000001E
#define _CM3CON_ENPGA_MASK                       0x40000000
#define _CM3CON_ENPGA_LENGTH                     0x00000001

#define _CM3CON_OPAON_POSITION                   0x0000001F
#define _CM3CON_OPAON_MASK                       0x80000000
#define _CM3CON_OPAON_LENGTH                     0x00000001

#define _CM3MSKCON_AANEN_POSITION                0x00000000
#define _CM3MSKCON_AANEN_MASK                    0x00000001
#define _CM3MSKCON_AANEN_LENGTH                  0x00000001

#define _CM3MSKCON_AAEN_POSITION                 0x00000001
#define _CM3MSKCON_AAEN_MASK                     0x00000002
#define _CM3MSKCON_AAEN_LENGTH                   0x00000001

#define _CM3MSKCON_ABNEN_POSITION                0x00000002
#define _CM3MSKCON_ABNEN_MASK                    0x00000004
#define _CM3MSKCON_ABNEN_LENGTH                  0x00000001

#define _CM3MSKCON_ABEN_POSITION                 0x00000003
#define _CM3MSKCON_ABEN_MASK                     0x00000008
#define _CM3MSKCON_ABEN_LENGTH                   0x00000001

#define _CM3MSKCON_ACNEN_POSITION                0x00000004
#define _CM3MSKCON_ACNEN_MASK                    0x00000010
#define _CM3MSKCON_ACNEN_LENGTH                  0x00000001

#define _CM3MSKCON_ACEN_POSITION                 0x00000005
#define _CM3MSKCON_ACEN_MASK                     0x00000020
#define _CM3MSKCON_ACEN_LENGTH                   0x00000001

#define _CM3MSKCON_PAGS_POSITION                 0x00000006
#define _CM3MSKCON_PAGS_MASK                     0x00000040
#define _CM3MSKCON_PAGS_LENGTH                   0x00000001

#define _CM3MSKCON_NAGS_POSITION                 0x00000007
#define _CM3MSKCON_NAGS_MASK                     0x00000080
#define _CM3MSKCON_NAGS_LENGTH                   0x00000001

#define _CM3MSKCON_OANEN_POSITION                0x00000008
#define _CM3MSKCON_OANEN_MASK                    0x00000100
#define _CM3MSKCON_OANEN_LENGTH                  0x00000001

#define _CM3MSKCON_OAEN_POSITION                 0x00000009
#define _CM3MSKCON_OAEN_MASK                     0x00000200
#define _CM3MSKCON_OAEN_LENGTH                   0x00000001

#define _CM3MSKCON_OBNEN_POSITION                0x0000000A
#define _CM3MSKCON_OBNEN_MASK                    0x00000400
#define _CM3MSKCON_OBNEN_LENGTH                  0x00000001

#define _CM3MSKCON_OBEN_POSITION                 0x0000000B
#define _CM3MSKCON_OBEN_MASK                     0x00000800
#define _CM3MSKCON_OBEN_LENGTH                   0x00000001

#define _CM3MSKCON_OCNEN_POSITION                0x0000000C
#define _CM3MSKCON_OCNEN_MASK                    0x00001000
#define _CM3MSKCON_OCNEN_LENGTH                  0x00000001

#define _CM3MSKCON_OCEN_POSITION                 0x0000000D
#define _CM3MSKCON_OCEN_MASK                     0x00002000
#define _CM3MSKCON_OCEN_LENGTH                   0x00000001

#define _CM3MSKCON_HLMS_POSITION                 0x0000000F
#define _CM3MSKCON_HLMS_MASK                     0x00008000
#define _CM3MSKCON_HLMS_LENGTH                   0x00000001

#define _CM3MSKCON_SELSRCA_POSITION              0x00000010
#define _CM3MSKCON_SELSRCA_MASK                  0x000F0000
#define _CM3MSKCON_SELSRCA_LENGTH                0x00000004

#define _CM3MSKCON_SELSRCB_POSITION              0x00000014
#define _CM3MSKCON_SELSRCB_MASK                  0x00F00000
#define _CM3MSKCON_SELSRCB_LENGTH                0x00000004

#define _CM3MSKCON_SELSRCC_POSITION              0x00000018
#define _CM3MSKCON_SELSRCC_MASK                  0x0F000000
#define _CM3MSKCON_SELSRCC_LENGTH                0x00000004

#define _CM4CON_CCH_POSITION                     0x00000000
#define _CM4CON_CCH_MASK                         0x00000003
#define _CM4CON_CCH_LENGTH                       0x00000002

#define _CM4CON_CREF_POSITION                    0x00000004
#define _CM4CON_CREF_MASK                        0x00000010
#define _CM4CON_CREF_LENGTH                      0x00000001

#define _CM4CON_EVPOL_POSITION                   0x00000006
#define _CM4CON_EVPOL_MASK                       0x000000C0
#define _CM4CON_EVPOL_LENGTH                     0x00000002

#define _CM4CON_COUT_POSITION                    0x00000008
#define _CM4CON_COUT_MASK                        0x00000100
#define _CM4CON_COUT_LENGTH                      0x00000001

#define _CM4CON_CEVT_POSITION                    0x00000009
#define _CM4CON_CEVT_MASK                        0x00000200
#define _CM4CON_CEVT_LENGTH                      0x00000001

