Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
#define _CNENC_w_POSITION                        0x00000000
#define _CNENC_w_MASK                            0xFFFFFFFF
#define _CNENC_w_LENGTH                          0x00000020

#define _CNSTATC_CNSTATC0_POSITION               0x00000000
#define _CNSTATC_CNSTATC0_MASK                   0x00000001
#define _CNSTATC_CNSTATC0_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC1_POSITION               0x00000001
#define _CNSTATC_CNSTATC1_MASK                   0x00000002
#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC2_POSITION               0x00000002
#define _CNSTATC_CNSTATC2_MASK                   0x00000004
#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC6_POSITION               0x00000006
#define _CNSTATC_CNSTATC6_MASK                   0x00000040
#define _CNSTATC_CNSTATC6_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC7_POSITION               0x00000007
#define _CNSTATC_CNSTATC7_MASK                   0x00000080
#define _CNSTATC_CNSTATC7_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC8_POSITION               0x00000008
#define _CNSTATC_CNSTATC8_MASK                   0x00000100
#define _CNSTATC_CNSTATC8_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC10_POSITION              0x0000000A
#define _CNSTATC_CNSTATC10_MASK                  0x00000400
#define _CNSTATC_CNSTATC10_LENGTH                0x00000001

#define _CNSTATC_CNSTATC11_POSITION              0x0000000B
#define _CNSTATC_CNSTATC11_MASK                  0x00000800
#define _CNSTATC_CNSTATC11_LENGTH                0x00000001

#define _CNSTATC_CNSTATC12_POSITION              0x0000000C
#define _CNSTATC_CNSTATC12_MASK                  0x00001000
#define _CNSTATC_CNSTATC12_LENGTH                0x00000001

#define _CNSTATC_CNSTATC15_POSITION              0x0000000F
#define _CNSTATC_CNSTATC15_MASK                  0x00008000
#define _CNSTATC_CNSTATC15_LENGTH                0x00000001

#define _CNSTATC_w_POSITION                      0x00000000
#define _CNSTATC_w_MASK                          0xFFFFFFFF
#define _CNSTATC_w_LENGTH                        0x00000020

#define _CNNEC_CNNEC0_POSITION                   0x00000000
#define _CNNEC_CNNEC0_MASK                       0x00000001
#define _CNNEC_CNNEC0_LENGTH                     0x00000001

#define _CNNEC_CNNEC1_POSITION                   0x00000001
#define _CNNEC_CNNEC1_MASK                       0x00000002
#define _CNNEC_CNNEC1_LENGTH                     0x00000001

#define _CNNEC_CNNEC2_POSITION                   0x00000002
#define _CNNEC_CNNEC2_MASK                       0x00000004
#define _CNNEC_CNNEC2_LENGTH                     0x00000001

#define _CNNEC_CNNEC6_POSITION                   0x00000006
#define _CNNEC_CNNEC6_MASK                       0x00000040
#define _CNNEC_CNNEC6_LENGTH                     0x00000001

#define _CNNEC_CNNEC7_POSITION                   0x00000007
#define _CNNEC_CNNEC7_MASK                       0x00000080
#define _CNNEC_CNNEC7_LENGTH                     0x00000001

#define _CNNEC_CNNEC8_POSITION                   0x00000008
#define _CNNEC_CNNEC8_MASK                       0x00000100
#define _CNNEC_CNNEC8_LENGTH                     0x00000001

#define _CNNEC_CNNEC9_POSITION                   0x00000009
#define _CNNEC_CNNEC9_MASK                       0x00000200
#define _CNNEC_CNNEC9_LENGTH                     0x00000001

#define _CNNEC_CNNEC10_POSITION                  0x0000000A
#define _CNNEC_CNNEC10_MASK                      0x00000400
#define _CNNEC_CNNEC10_LENGTH                    0x00000001

#define _CNNEC_CNNEC11_POSITION                  0x0000000B
#define _CNNEC_CNNEC11_MASK                      0x00000800
#define _CNNEC_CNNEC11_LENGTH                    0x00000001

#define _CNNEC_CNNEC12_POSITION                  0x0000000C
#define _CNNEC_CNNEC12_MASK                      0x00001000
#define _CNNEC_CNNEC12_LENGTH                    0x00000001

#define _CNNEC_CNNEC15_POSITION                  0x0000000F
#define _CNNEC_CNNEC15_MASK                      0x00008000
#define _CNNEC_CNNEC15_LENGTH                    0x00000001

#define _CNFC_CNFC0_POSITION                     0x00000000
#define _CNFC_CNFC0_MASK                         0x00000001
#define _CNFC_CNFC0_LENGTH                       0x00000001

#define _CNFC_CNFC1_POSITION                     0x00000001
#define _CNFC_CNFC1_MASK                         0x00000002
#define _CNFC_CNFC1_LENGTH                       0x00000001

#define _CNFC_CNFC2_POSITION                     0x00000002
#define _CNFC_CNFC2_MASK                         0x00000004
#define _CNFC_CNFC2_LENGTH                       0x00000001

#define _CNFC_CNFC6_POSITION                     0x00000006
#define _CNFC_CNFC6_MASK                         0x00000040
#define _CNFC_CNFC6_LENGTH                       0x00000001

#define _CNFC_CNFC7_POSITION                     0x00000007
#define _CNFC_CNFC7_MASK                         0x00000080
#define _CNFC_CNFC7_LENGTH                       0x00000001

#define _CNFC_CNFC8_POSITION                     0x00000008
#define _CNFC_CNFC8_MASK                         0x00000100
#define _CNFC_CNFC8_LENGTH                       0x00000001

#define _CNFC_CNFC9_POSITION                     0x00000009
#define _CNFC_CNFC9_MASK                         0x00000200
#define _CNFC_CNFC9_LENGTH                       0x00000001

#define _CNFC_CNFC10_POSITION                    0x0000000A
#define _CNFC_CNFC10_MASK                        0x00000400
#define _CNFC_CNFC10_LENGTH                      0x00000001

#define _CNFC_CNFC11_POSITION                    0x0000000B
#define _CNFC_CNFC11_MASK                        0x00000800
#define _CNFC_CNFC11_LENGTH                      0x00000001

#define _CNFC_CNFC12_POSITION                    0x0000000C
#define _CNFC_CNFC12_MASK                        0x00001000
#define _CNFC_CNFC12_LENGTH                      0x00000001

#define _CNFC_CNFC15_POSITION                    0x0000000F
#define _CNFC_CNFC15_MASK                        0x00008000
#define _CNFC_CNFC15_LENGTH                      0x00000001

#define _SRCON0C_SR0C6_POSITION                  0x00000006
#define _SRCON0C_SR0C6_MASK                      0x00000040
#define _SRCON0C_SR0C6_LENGTH                    0x00000001

#define _SRCON0C_SR0C7_POSITION                  0x00000007
#define _SRCON0C_SR0C7_MASK                      0x00000080
#define _SRCON0C_SR0C7_LENGTH                    0x00000001

