Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
#define _ADCEIEN2_EIEN50_POSITION                0x00000012
#define _ADCEIEN2_EIEN50_MASK                    0x00040000
#define _ADCEIEN2_EIEN50_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN53_POSITION                0x00000015
#define _ADCEIEN2_EIEN53_MASK                    0x00200000
#define _ADCEIEN2_EIEN53_LENGTH                  0x00000001

#define _ADCEISTAT1_EIRDY0_POSITION              0x00000000
#define _ADCEISTAT1_EIRDY0_MASK                  0x00000001
#define _ADCEISTAT1_EIRDY0_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY1_POSITION              0x00000001
#define _ADCEISTAT1_EIRDY1_MASK                  0x00000002
#define _ADCEISTAT1_EIRDY1_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY2_POSITION              0x00000002
#define _ADCEISTAT1_EIRDY2_MASK                  0x00000004
#define _ADCEISTAT1_EIRDY2_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY3_POSITION              0x00000003
#define _ADCEISTAT1_EIRDY3_MASK                  0x00000008
#define _ADCEISTAT1_EIRDY3_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY4_POSITION              0x00000004
#define _ADCEISTAT1_EIRDY4_MASK                  0x00000010
#define _ADCEISTAT1_EIRDY4_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY5_POSITION              0x00000005
#define _ADCEISTAT1_EIRDY5_MASK                  0x00000020
#define _ADCEISTAT1_EIRDY5_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY6_POSITION              0x00000006
#define _ADCEISTAT1_EIRDY6_MASK                  0x00000040
#define _ADCEISTAT1_EIRDY6_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY7_POSITION              0x00000007
#define _ADCEISTAT1_EIRDY7_MASK                  0x00000080
#define _ADCEISTAT1_EIRDY7_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY8_POSITION              0x00000008
#define _ADCEISTAT1_EIRDY8_MASK                  0x00000100
#define _ADCEISTAT1_EIRDY8_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY9_POSITION              0x00000009
#define _ADCEISTAT1_EIRDY9_MASK                  0x00000200
#define _ADCEISTAT1_EIRDY9_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY10_POSITION             0x0000000A
#define _ADCEISTAT1_EIRDY10_MASK                 0x00000400
#define _ADCEISTAT1_EIRDY10_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY11_POSITION             0x0000000B
#define _ADCEISTAT1_EIRDY11_MASK                 0x00000800
#define _ADCEISTAT1_EIRDY11_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY12_POSITION             0x0000000C
#define _ADCEISTAT1_EIRDY12_MASK                 0x00001000
#define _ADCEISTAT1_EIRDY12_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY13_POSITION             0x0000000D
#define _ADCEISTAT1_EIRDY13_MASK                 0x00002000
#define _ADCEISTAT1_EIRDY13_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY14_POSITION             0x0000000E
#define _ADCEISTAT1_EIRDY14_MASK                 0x00004000
#define _ADCEISTAT1_EIRDY14_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY15_POSITION             0x0000000F
#define _ADCEISTAT1_EIRDY15_MASK                 0x00008000
#define _ADCEISTAT1_EIRDY15_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY16_POSITION             0x00000010
#define _ADCEISTAT1_EIRDY16_MASK                 0x00010000
#define _ADCEISTAT1_EIRDY16_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY17_POSITION             0x00000011
#define _ADCEISTAT1_EIRDY17_MASK                 0x00020000
#define _ADCEISTAT1_EIRDY17_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY50_POSITION             0x00000012
#define _ADCEISTAT2_EIRDY50_MASK                 0x00040000
#define _ADCEISTAT2_EIRDY50_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY53_POSITION             0x00000015
#define _ADCEISTAT2_EIRDY53_MASK                 0x00200000
#define _ADCEISTAT2_EIRDY53_LENGTH               0x00000001

#define _ADCANCON_ANEN0_POSITION                 0x00000000
#define _ADCANCON_ANEN0_MASK                     0x00000001
#define _ADCANCON_ANEN0_LENGTH                   0x00000001

#define _ADCANCON_ANEN1_POSITION                 0x00000001
#define _ADCANCON_ANEN1_MASK                     0x00000002
#define _ADCANCON_ANEN1_LENGTH                   0x00000001

#define _ADCANCON_ANEN7_POSITION                 0x00000007
#define _ADCANCON_ANEN7_MASK                     0x00000080
#define _ADCANCON_ANEN7_LENGTH                   0x00000001

#define _ADCANCON_WKRDY0_POSITION                0x00000008
#define _ADCANCON_WKRDY0_MASK                    0x00000100
#define _ADCANCON_WKRDY0_LENGTH                  0x00000001

#define _ADCANCON_WKRDY1_POSITION                0x00000009
#define _ADCANCON_WKRDY1_MASK                    0x00000200
#define _ADCANCON_WKRDY1_LENGTH                  0x00000001

#define _ADCANCON_WKRDY7_POSITION                0x0000000F
#define _ADCANCON_WKRDY7_MASK                    0x00008000
#define _ADCANCON_WKRDY7_LENGTH                  0x00000001

#define _ADCANCON_WKIEN0_POSITION                0x00000010
#define _ADCANCON_WKIEN0_MASK                    0x00010000
#define _ADCANCON_WKIEN0_LENGTH                  0x00000001

#define _ADCANCON_WKIEN1_POSITION                0x00000011
#define _ADCANCON_WKIEN1_MASK                    0x00020000
#define _ADCANCON_WKIEN1_LENGTH                  0x00000001

#define _ADCANCON_WKIEN7_POSITION                0x00000017
#define _ADCANCON_WKIEN7_MASK                    0x00800000
#define _ADCANCON_WKIEN7_LENGTH                  0x00000001

#define _ADCANCON_WKUPCLKCNT_POSITION            0x00000018
#define _ADCANCON_WKUPCLKCNT_MASK                0x0F000000
#define _ADCANCON_WKUPCLKCNT_LENGTH              0x00000004

#define _ADCDATA0_DATA_POSITION                  0x00000000
#define _ADCDATA0_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA0_DATA_LENGTH                    0x00000020

#define _ADCDATA1_DATA_POSITION                  0x00000000
#define _ADCDATA1_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA1_DATA_LENGTH                    0x00000020

