Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca048.h
#define _ADCDATA2_DATA_POSITION                  0x00000000
#define _ADCDATA2_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA2_DATA_LENGTH                    0x00000020

#define _ADCDATA3_DATA_POSITION                  0x00000000
#define _ADCDATA3_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA3_DATA_LENGTH                    0x00000020

#define _ADCDATA4_DATA_POSITION                  0x00000000
#define _ADCDATA4_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA4_DATA_LENGTH                    0x00000020

#define _ADCDATA5_DATA_POSITION                  0x00000000
#define _ADCDATA5_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA5_DATA_LENGTH                    0x00000020

#define _ADCDATA6_DATA_POSITION                  0x00000000
#define _ADCDATA6_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA6_DATA_LENGTH                    0x00000020

#define _ADCDATA7_DATA_POSITION                  0x00000000
#define _ADCDATA7_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA7_DATA_LENGTH                    0x00000020

#define _ADCDATA8_DATA_POSITION                  0x00000000
#define _ADCDATA8_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA8_DATA_LENGTH                    0x00000020

#define _ADCDATA9_DATA_POSITION                  0x00000000
#define _ADCDATA9_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA9_DATA_LENGTH                    0x00000020

#define _ADCDATA10_DATA_POSITION                 0x00000000
#define _ADCDATA10_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA10_DATA_LENGTH                   0x00000020

#define _ADCDATA11_DATA_POSITION                 0x00000000
#define _ADCDATA11_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA11_DATA_LENGTH                   0x00000020

#define _ADCDATA12_DATA_POSITION                 0x00000000
#define _ADCDATA12_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA12_DATA_LENGTH                   0x00000020

#define _ADCDATA13_DATA_POSITION                 0x00000000
#define _ADCDATA13_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA13_DATA_LENGTH                   0x00000020

#define _ADCDATA14_DATA_POSITION                 0x00000000
#define _ADCDATA14_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA14_DATA_LENGTH                   0x00000020

#define _ADCDATA15_DATA_POSITION                 0x00000000
#define _ADCDATA15_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA15_DATA_LENGTH                   0x00000020

#define _ADCDATA16_DATA_POSITION                 0x00000000
#define _ADCDATA16_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA16_DATA_LENGTH                   0x00000020

#define _ADCDATA17_DATA_POSITION                 0x00000000
#define _ADCDATA17_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA17_DATA_LENGTH                   0x00000020

#define _ADCDATA50_DATA_POSITION                 0x00000000
#define _ADCDATA50_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA50_DATA_LENGTH                   0x00000020

#define _ADCDATA53_DATA_POSITION                 0x00000000
#define _ADCDATA53_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA53_DATA_LENGTH                   0x00000020

#define _ADC0CFG_ADCCFG_POSITION                 0x00000000
#define _ADC0CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC0CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC1CFG_ADCCFG_POSITION                 0x00000000
#define _ADC1CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC1CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC7CFG_ADCCFG_POSITION                 0x00000000
#define _ADC7CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC7CFG_ADCCFG_LENGTH                   0x00000020

#define _ADCSYSCFG0_AN0_POSITION                 0x00000000
#define _ADCSYSCFG0_AN0_MASK                     0x00000001
#define _ADCSYSCFG0_AN0_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN1_POSITION                 0x00000001
#define _ADCSYSCFG0_AN1_MASK                     0x00000002
#define _ADCSYSCFG0_AN1_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN2_POSITION                 0x00000002
#define _ADCSYSCFG0_AN2_MASK                     0x00000004
#define _ADCSYSCFG0_AN2_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN3_POSITION                 0x00000003
#define _ADCSYSCFG0_AN3_MASK                     0x00000008
#define _ADCSYSCFG0_AN3_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN4_POSITION                 0x00000004
#define _ADCSYSCFG0_AN4_MASK                     0x00000010
#define _ADCSYSCFG0_AN4_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN5_POSITION                 0x00000005
#define _ADCSYSCFG0_AN5_MASK                     0x00000020
#define _ADCSYSCFG0_AN5_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN6_POSITION                 0x00000006
#define _ADCSYSCFG0_AN6_MASK                     0x00000040
#define _ADCSYSCFG0_AN6_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN7_POSITION                 0x00000007
#define _ADCSYSCFG0_AN7_MASK                     0x00000080
#define _ADCSYSCFG0_AN7_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN8_POSITION                 0x00000008
#define _ADCSYSCFG0_AN8_MASK                     0x00000100
#define _ADCSYSCFG0_AN8_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN9_POSITION                 0x00000009
#define _ADCSYSCFG0_AN9_MASK                     0x00000200
#define _ADCSYSCFG0_AN9_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN10_POSITION                0x0000000A
#define _ADCSYSCFG0_AN10_MASK                    0x00000400
#define _ADCSYSCFG0_AN10_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN11_POSITION                0x0000000B
#define _ADCSYSCFG0_AN11_MASK                    0x00000800
#define _ADCSYSCFG0_AN11_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN12_POSITION                0x0000000C
#define _ADCSYSCFG0_AN12_MASK                    0x00001000
#define _ADCSYSCFG0_AN12_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN13_POSITION                0x0000000D
#define _ADCSYSCFG0_AN13_MASK                    0x00002000
#define _ADCSYSCFG0_AN13_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN14_POSITION                0x0000000E
#define _ADCSYSCFG0_AN14_MASK                    0x00004000
#define _ADCSYSCFG0_AN14_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN15_POSITION                0x0000000F
#define _ADCSYSCFG0_AN15_MASK                    0x00008000
#define _ADCSYSCFG0_AN15_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN16_POSITION                0x00000010
#define _ADCSYSCFG0_AN16_MASK                    0x00010000
#define _ADCSYSCFG0_AN16_LENGTH                  0x00000001

